#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ML1MiuwuMd00501_Vision

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "ABP_MonsterCommon_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ML1MiuwuMd00501_Vision.ABP_ML1MiuwuMd00501_Vision_C
// 0x09E0 (0x3940 - 0x2F60)
class UABP_ML1MiuwuMd00501_Vision_C final : public UABP_MonsterCommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABP_ML1MiuwuMd00501_Vision_C;       // 0x2F58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1_ABP_ML1MiuwuMd00501_Vision_C; // 0x2F60(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABP_ML1MiuwuMd00501_Vision_C; // 0x2F98(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABP_ML1MiuwuMd00501_Vision_C; // 0x2FB8(0x0020)()
	struct FAnimNode_Feedback                     AnimGraphNode_Feedback_ABP_ML1MiuwuMd00501_Vision_C; // 0x2FD8(0x0278)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock_ABP_ML1MiuwuMd00501_Vision_C; // 0x3250(0x01D0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_ABP_ML1MiuwuMd00501_Vision_C; // 0x3420(0x0138)()
	struct FAnimNode_BoneRotateToLocation         AnimGraphNode_BoneRotateToLocation_ABP_ML1MiuwuMd00501_Vision_C; // 0x3558(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABP_ML1MiuwuMd00501_Vision_C;   // 0x3690(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABP_ML1MiuwuMd00501_Vision_C; // 0x36C8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABP_ML1MiuwuMd00501_Vision_C; // 0x3758(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ABP_ML1MiuwuMd00501_Vision_C; // 0x3790(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ABP_ML1MiuwuMd00501_Vision_C;   // 0x38D8(0x0060)()

public:
	void ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision_AnimGraphNode_Feedback_160B928D4ACF6CD875FCAAB6BA31E5C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision_AnimGraphNode_BoneRotateToLocation_70BFD0544F5ABBF2C8673793051A8B7B();
	void AnimGraph(struct FPoseLink* Param_AnimGraph_0);
	void IKAndFk_Clone(const struct FPoseLink& InPose, struct FPoseLink* IKAndFk_Clone_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ML1MiuwuMd00501_Vision_C">();
	}
	static class UABP_ML1MiuwuMd00501_Vision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ML1MiuwuMd00501_Vision_C>();
	}
};
static_assert(alignof(UABP_ML1MiuwuMd00501_Vision_C) == 0x000010, "Wrong alignment on UABP_ML1MiuwuMd00501_Vision_C");
static_assert(sizeof(UABP_ML1MiuwuMd00501_Vision_C) == 0x003940, "Wrong size on UABP_ML1MiuwuMd00501_Vision_C");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, UberGraphFrame_ABP_ML1MiuwuMd00501_Vision_C) == 0x002F58, "Member 'UABP_ML1MiuwuMd00501_Vision_C::UberGraphFrame_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_Root_1_ABP_ML1MiuwuMd00501_Vision_C) == 0x002F60, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_Root_1_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_LocalToComponentSpace_ABP_ML1MiuwuMd00501_Vision_C) == 0x002F98, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_LocalToComponentSpace_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_ComponentToLocalSpace_ABP_ML1MiuwuMd00501_Vision_C) == 0x002FB8, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_ComponentToLocalSpace_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_Feedback_ABP_ML1MiuwuMd00501_Vision_C) == 0x002FD8, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_Feedback_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_SightLock_ABP_ML1MiuwuMd00501_Vision_C) == 0x003250, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_SightLock_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_LinkedInputPose_ABP_ML1MiuwuMd00501_Vision_C) == 0x003420, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_LinkedInputPose_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_BoneRotateToLocation_ABP_ML1MiuwuMd00501_Vision_C) == 0x003558, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_BoneRotateToLocation_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_Root_ABP_ML1MiuwuMd00501_Vision_C) == 0x003690, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_Root_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_SequencePlayer_ABP_ML1MiuwuMd00501_Vision_C) == 0x0036C8, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_SequencePlayer_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_StateResult_ABP_ML1MiuwuMd00501_Vision_C) == 0x003758, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_StateResult_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_StateMachine_ABP_ML1MiuwuMd00501_Vision_C) == 0x003790, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_StateMachine_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");
static_assert(offsetof(UABP_ML1MiuwuMd00501_Vision_C, AnimGraphNode_Slot_ABP_ML1MiuwuMd00501_Vision_C) == 0x0038D8, "Member 'UABP_ML1MiuwuMd00501_Vision_C::AnimGraphNode_Slot_ABP_ML1MiuwuMd00501_Vision_C' has a wrong offset!");

}

