#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ML1MiuwuMd00501_Vision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"


namespace SDK::Params
{

// Function ABP_ML1MiuwuMd00501_Vision.ABP_ML1MiuwuMd00501_Vision_C.ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision
// 0x0028 (0x0028 - 0x0000)
struct ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitBones                              K2Node_MakeStruct_HitBones;                        // 0x0008(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision) == 0x000008, "Wrong alignment on ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision");
static_assert(sizeof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision) == 0x000028, "Wrong size on ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, EntryPoint) == 0x000000, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, K2Node_MakeStruct_HitBones) == 0x000008, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::K2Node_MakeStruct_HitBones' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, CallFunc_BooleanOR_ReturnValue_1) == 0x000018, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision, CallFunc_BooleanOR_ReturnValue_2) == 0x000020, "Member 'ABP_ML1MiuwuMd00501_Vision_C_ExecuteUbergraph_ABP_ML1MiuwuMd00501_Vision::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function ABP_ML1MiuwuMd00501_Vision.ABP_ML1MiuwuMd00501_Vision_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ML1MiuwuMd00501_Vision_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ML1MiuwuMd00501_Vision_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ML1MiuwuMd00501_Vision_C_AnimGraph");
static_assert(sizeof(ABP_ML1MiuwuMd00501_Vision_C_AnimGraph) == 0x000010, "Wrong size on ABP_ML1MiuwuMd00501_Vision_C_AnimGraph");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_AnimGraph, Param_AnimGraph_0) == 0x000000, "Member 'ABP_ML1MiuwuMd00501_Vision_C_AnimGraph::Param_AnimGraph_0' has a wrong offset!");

// Function ABP_ML1MiuwuMd00501_Vision.ABP_ML1MiuwuMd00501_Vision_C.IKAndFk_Clone
// 0x0020 (0x0020 - 0x0000)
struct ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              IKAndFk_Clone_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone) == 0x000008, "Wrong alignment on ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone");
static_assert(sizeof(ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone) == 0x000020, "Wrong size on ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone, InPose) == 0x000000, "Member 'ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone::InPose' has a wrong offset!");
static_assert(offsetof(ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone, IKAndFk_Clone_0) == 0x000010, "Member 'ABP_ML1MiuwuMd00501_Vision_C_IKAndFk_Clone::IKAndFk_Clone_0' has a wrong offset!");

}

