#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EDarkNvzhuWing

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_EDarkNvzhuWing.ABP_EDarkNvzhuWing_C.ExecuteUbergraph_ABP_EDarkNvzhuWing
// 0x0050 (0x0050 - 0x0000)
struct ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugAnimNodeString_ReturnValue;       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_MainAnimInstance_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing) == 0x000008, "Wrong alignment on ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing");
static_assert(sizeof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing) == 0x000050, "Wrong size on ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, EntryPoint) == 0x000000, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, CallFunc_GetDebugAnimNodeString_ReturnValue) == 0x000008, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::CallFunc_GetDebugAnimNodeString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, K2Node_DynamicCast_AsTs_Base_Character) == 0x000038, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, K2Node_Event_DeltaTimeX) == 0x000044, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing, CallFunc_MainAnimInstance_ReturnValue) == 0x000048, "Member 'ABP_EDarkNvzhuWing_C_ExecuteUbergraph_ABP_EDarkNvzhuWing::CallFunc_MainAnimInstance_ReturnValue' has a wrong offset!");

// Function ABP_EDarkNvzhuWing.ABP_EDarkNvzhuWing_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_EDarkNvzhuWing_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_EDarkNvzhuWing.ABP_EDarkNvzhuWing_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_EDarkNvzhuWing_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_EDarkNvzhuWing_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_EDarkNvzhuWing_C_AnimGraph");
static_assert(sizeof(ABP_EDarkNvzhuWing_C_AnimGraph) == 0x000010, "Wrong size on ABP_EDarkNvzhuWing_C_AnimGraph");
static_assert(offsetof(ABP_EDarkNvzhuWing_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_EDarkNvzhuWing_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

