#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NM013_Floater

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NM013_Floater.ABP_NM013_Floater_C
// 0x03D0 (0x0A30 - 0x0660)
class UABP_NM013_Floater_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0668(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x06A0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0728(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0750(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07E0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0818(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x08A8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x08E0(0x0148)()
	float                                         GroundSpeed;                                       // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_NM013_Floater(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NM013_Floater_AnimGraphNode_TransitionResult_F18F4BC54DB04CB2A7DEE38EEABFF96B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NM013_Floater_AnimGraphNode_TransitionResult_BCAD437645CE53A45F0876856566C406();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_NM013_Floater_C">();
	}
	static class UABP_NM013_Floater_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NM013_Floater_C>();
	}
};
static_assert(alignof(UABP_NM013_Floater_C) == 0x000010, "Wrong alignment on UABP_NM013_Floater_C");
static_assert(sizeof(UABP_NM013_Floater_C) == 0x000A30, "Wrong size on UABP_NM013_Floater_C");
static_assert(offsetof(UABP_NM013_Floater_C, UberGraphFrame) == 0x000660, "Member 'UABP_NM013_Floater_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_Root) == 0x000668, "Member 'UABP_NM013_Floater_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_Slot) == 0x0006A0, "Member 'UABP_NM013_Floater_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_TransitionResult_1) == 0x000700, "Member 'UABP_NM013_Floater_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_TransitionResult) == 0x000728, "Member 'UABP_NM013_Floater_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_SequencePlayer_1) == 0x000750, "Member 'UABP_NM013_Floater_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_StateResult_1) == 0x0007E0, "Member 'UABP_NM013_Floater_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_SequencePlayer) == 0x000818, "Member 'UABP_NM013_Floater_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_StateResult) == 0x0008A8, "Member 'UABP_NM013_Floater_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, AnimGraphNode_StateMachine) == 0x0008E0, "Member 'UABP_NM013_Floater_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_NM013_Floater_C, GroundSpeed) == 0x000A28, "Member 'UABP_NM013_Floater_C::GroundSpeed' has a wrong offset!");

}

