#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_MO1LeiXYLMd00301_02

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02
// 0x0190 (0x0190 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0028)(ZeroConstructor)
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0028)(ZeroConstructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bContent_5;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0028)(ZeroConstructor)
	bool                                          CallFunc_BeginSkill_ReturnValue;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_2;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginSkill_ReturnValue_1;                 // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____EntityId__;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_____EntityId___1;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_1;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____EntityId___2;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_____EntityId___3;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_____EntityId___4;                         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_3;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_5;            // 0x0130(0x0028)(ZeroConstructor)
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_2;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_3;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_4;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_4;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_5;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02) == 0x000008, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02) == 0x000190, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, EntryPoint) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_ContainsTag_ReturnValue) == 0x0000A8, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_ContainsTag_ReturnValue_1) == 0x0000A9, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_K2_GetPawn_ReturnValue) == 0x0000B0, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_DynamicCast_AsTs_Base_Character) == 0x0000B8, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent_5) == 0x0000C1, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent_5' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_BeginSkill_ReturnValue) == 0x0000F0, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_BeginSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue) == 0x0000F8, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent_4) == 0x000100, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent_4' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_ContainsTag_ReturnValue_2) == 0x000101, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_ContainsTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_BeginSkill_ReturnValue_1) == 0x000102, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_BeginSkill_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_____EntityId__) == 0x000104, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_____EntityId__' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_____EntityId___1) == 0x000108, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_____EntityId___1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue_1) == 0x000110, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent_3) == 0x000118, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent_3' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_____EntityId___2) == 0x00011C, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_____EntityId___2' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_____EntityId___3) == 0x000120, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_____EntityId___3' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_____EntityId___4) == 0x000124, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_____EntityId___4' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_ContainsTag_ReturnValue_3) == 0x000128, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_ContainsTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CreateDelegate_OutputDelegate_5) == 0x000130, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue_2) == 0x000158, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue_3) == 0x000160, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent_2) == 0x000168, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent_2' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue_4) == 0x000170, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent_1) == 0x000178, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc_ContainsTag_ReturnValue_4) == 0x000179, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc_ContainsTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, CallFunc___AIC___ReturnValue_5) == 0x000180, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::CallFunc___AIC___ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02, K2Node_CustomEvent_bContent) == 0x000188, "Member 'AIC_MO1LeiXYLMd00301_02_C_ExecuteUbergraph_AIC_MO1LeiXYLMd00301_02::K2Node_CustomEvent_bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.进战重置
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_进战重置 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_进战重置) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_进战重置");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_进战重置) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_进战重置");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_进战重置, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_进战重置::bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.限制解除
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_限制解除 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_限制解除) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_限制解除");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_限制解除) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_限制解除");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_限制解除, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_限制解除::bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.合击目标重置
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_合击目标重置 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_合击目标重置) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_合击目标重置");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_合击目标重置) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_合击目标重置");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_合击目标重置, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_合击目标重置::bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.派对散伙
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_派对散伙 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_派对散伙) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_派对散伙");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_派对散伙) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_派对散伙");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_派对散伙, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_派对散伙::bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.群嘲派对
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_群嘲派对 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_群嘲派对) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_群嘲派对");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_群嘲派对) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_群嘲派对");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_群嘲派对, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_群嘲派对::bContent' has a wrong offset!");

// Function AIC_MO1LeiXYLMd00301_02.AIC_MO1LeiXYLMd00301_02_C.嘲讽
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1LeiXYLMd00301_02_C_嘲讽 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1LeiXYLMd00301_02_C_嘲讽) == 0x000001, "Wrong alignment on AIC_MO1LeiXYLMd00301_02_C_嘲讽");
static_assert(sizeof(AIC_MO1LeiXYLMd00301_02_C_嘲讽) == 0x000001, "Wrong size on AIC_MO1LeiXYLMd00301_02_C_嘲讽");
static_assert(offsetof(AIC_MO1LeiXYLMd00301_02_C_嘲讽, bContent) == 0x000000, "Member 'AIC_MO1LeiXYLMd00301_02_C_嘲讽::bContent' has a wrong offset!");

}

