#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackWaveComposite

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BlackWaveComposite.BP_BlackWaveComposite_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BlackWaveComposite_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlackWaveComposite_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BlackWaveComposite_C_ReceiveTick");
static_assert(sizeof(BP_BlackWaveComposite_C_ReceiveTick) == 0x000004, "Wrong size on BP_BlackWaveComposite_C_ReceiveTick");
static_assert(offsetof(BP_BlackWaveComposite_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BlackWaveComposite_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BlackWaveComposite.BP_BlackWaveComposite_C.ExecuteUbergraph_BP_BlackWaveComposite
// 0x0060 (0x0060 - 0x0000)
struct BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ___string_Variable;                                // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ___string_Variable_1;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_Map_Find_Value_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite) == 0x000008, "Wrong alignment on BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite");
static_assert(sizeof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite) == 0x000060, "Wrong size on BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, EntryPoint) == 0x000000, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, ___string_Variable) == 0x000008, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::___string_Variable' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, ___string_Variable_1) == 0x000018, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::___string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_Map_Find_Value) == 0x000040, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_Map_Find_Value_1) == 0x000050, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite, CallFunc_Map_Find_ReturnValue_1) == 0x000058, "Member 'BP_BlackWaveComposite_C_ExecuteUbergraph_BP_BlackWaveComposite::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

}

