#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Base_Jinxi

#include "Basic.hpp"

#include "TsBaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Base_Jinxi.BP_Base_Jinxi_C
// 0x0030 (0x0780 - 0x0750)
class ABP_Base_Jinxi_C : public ATsBaseCharacter_C
{
public:
	class USkeletalMeshComponent*                 OtherCase1;                                        // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001LThighTwist;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001RThighTwist;                                 // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001Spine2;                                      // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponCase0;                                       // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_in_Air;                                         // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Array_Index;                                       // 0x077C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FightCommand(bool isInAir);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Base_Jinxi_C">();
	}
	static class ABP_Base_Jinxi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Base_Jinxi_C>();
	}
};
static_assert(alignof(ABP_Base_Jinxi_C) == 0x000010, "Wrong alignment on ABP_Base_Jinxi_C");
static_assert(sizeof(ABP_Base_Jinxi_C) == 0x000780, "Wrong size on ABP_Base_Jinxi_C");
static_assert(offsetof(ABP_Base_Jinxi_C, OtherCase1) == 0x000750, "Member 'ABP_Base_Jinxi_C::OtherCase1' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, Bip001LThighTwist) == 0x000758, "Member 'ABP_Base_Jinxi_C::Bip001LThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, Bip001RThighTwist) == 0x000760, "Member 'ABP_Base_Jinxi_C::Bip001RThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, Bip001Spine2) == 0x000768, "Member 'ABP_Base_Jinxi_C::Bip001Spine2' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, WeaponCase0) == 0x000770, "Member 'ABP_Base_Jinxi_C::WeaponCase0' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, Is_in_Air) == 0x000778, "Member 'ABP_Base_Jinxi_C::Is_in_Air' has a wrong offset!");
static_assert(offsetof(ABP_Base_Jinxi_C, Array_Index) == 0x00077C, "Member 'ABP_Base_Jinxi_C::Array_Index' has a wrong offset!");

}

