#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkNvzhu

#include "Basic.hpp"

#include "TsBaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DarkNvzhu.BP_DarkNvzhu_C
// 0x0050 (0x07A0 - 0x0750)
class ABP_DarkNvzhu_C final : public ATsBaseCharacter_C
{
public:
	class UKuroAdjustableCapsuleComponent*        Bip001LThighTwist;                                 // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001RThighTwist;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001Spine2;                                      // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OtherCase4;                                        // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OtherCase3;                                        // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OtherCase1;                                        // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OtherCase2;                                        // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponCase1;                                       // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponCase0;                                       // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void FightCommand(bool isInAir);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DarkNvzhu_C">();
	}
	static class ABP_DarkNvzhu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DarkNvzhu_C>();
	}
};
static_assert(alignof(ABP_DarkNvzhu_C) == 0x000010, "Wrong alignment on ABP_DarkNvzhu_C");
static_assert(sizeof(ABP_DarkNvzhu_C) == 0x0007A0, "Wrong size on ABP_DarkNvzhu_C");
static_assert(offsetof(ABP_DarkNvzhu_C, Bip001LThighTwist) == 0x000750, "Member 'ABP_DarkNvzhu_C::Bip001LThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, Bip001RThighTwist) == 0x000758, "Member 'ABP_DarkNvzhu_C::Bip001RThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, Bip001Spine2) == 0x000760, "Member 'ABP_DarkNvzhu_C::Bip001Spine2' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, OtherCase4) == 0x000768, "Member 'ABP_DarkNvzhu_C::OtherCase4' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, OtherCase3) == 0x000770, "Member 'ABP_DarkNvzhu_C::OtherCase3' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, OtherCase1) == 0x000778, "Member 'ABP_DarkNvzhu_C::OtherCase1' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, OtherCase2) == 0x000780, "Member 'ABP_DarkNvzhu_C::OtherCase2' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, WeaponCase1) == 0x000788, "Member 'ABP_DarkNvzhu_C::WeaponCase1' has a wrong offset!");
static_assert(offsetof(ABP_DarkNvzhu_C, WeaponCase0) == 0x000790, "Member 'ABP_DarkNvzhu_C::WeaponCase0' has a wrong offset!");

}

