#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FarRotatorCloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FarRotatorCloud.BP_FarRotatorCloud_C
// 0x0080 (0x0340 - 0x02C0)
class ABP_FarRotatorCloud_C final : public AKuroEditorTickActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Layer3;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Layer2;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Layer1;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Close_Billboard;                                   // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CloudRotatorSpeed_Layer1;                          // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloudRotatorSpeed_Layer2;                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloudRotatorSpeed_Layer3;                          // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WorldPositionOffset_Intansity;                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      Material_Layer1;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_Layer2;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_Layer3;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Material_Layer1;                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Material_Layer2;                               // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Material_Layer3;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeCloudFade;                                   // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FarRotatorCloud(int32 EntryPoint);
	void EditorTick(float DeltaSeconds);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FarRotatorCloud_C">();
	}
	static class ABP_FarRotatorCloud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FarRotatorCloud_C>();
	}
};
static_assert(alignof(ABP_FarRotatorCloud_C) == 0x000008, "Wrong alignment on ABP_FarRotatorCloud_C");
static_assert(sizeof(ABP_FarRotatorCloud_C) == 0x000340, "Wrong size on ABP_FarRotatorCloud_C");
static_assert(offsetof(ABP_FarRotatorCloud_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_FarRotatorCloud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Layer3) == 0x0002C8, "Member 'ABP_FarRotatorCloud_C::Layer3' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Layer2) == 0x0002D0, "Member 'ABP_FarRotatorCloud_C::Layer2' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Layer1) == 0x0002D8, "Member 'ABP_FarRotatorCloud_C::Layer1' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABP_FarRotatorCloud_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, StaticMesh) == 0x0002E8, "Member 'ABP_FarRotatorCloud_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Close_Billboard) == 0x0002F0, "Member 'ABP_FarRotatorCloud_C::Close_Billboard' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, CloudRotatorSpeed_Layer1) == 0x0002F4, "Member 'ABP_FarRotatorCloud_C::CloudRotatorSpeed_Layer1' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, CloudRotatorSpeed_Layer2) == 0x0002F8, "Member 'ABP_FarRotatorCloud_C::CloudRotatorSpeed_Layer2' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, CloudRotatorSpeed_Layer3) == 0x0002FC, "Member 'ABP_FarRotatorCloud_C::CloudRotatorSpeed_Layer3' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, WorldPositionOffset_Intansity) == 0x000300, "Member 'ABP_FarRotatorCloud_C::WorldPositionOffset_Intansity' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Material_Layer1) == 0x000308, "Member 'ABP_FarRotatorCloud_C::Material_Layer1' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Material_Layer2) == 0x000310, "Member 'ABP_FarRotatorCloud_C::Material_Layer2' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, Material_Layer3) == 0x000318, "Member 'ABP_FarRotatorCloud_C::Material_Layer3' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, MID_Material_Layer1) == 0x000320, "Member 'ABP_FarRotatorCloud_C::MID_Material_Layer1' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, MID_Material_Layer2) == 0x000328, "Member 'ABP_FarRotatorCloud_C::MID_Material_Layer2' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, MID_Material_Layer3) == 0x000330, "Member 'ABP_FarRotatorCloud_C::MID_Material_Layer3' has a wrong offset!");
static_assert(offsetof(ABP_FarRotatorCloud_C, VolumeCloudFade) == 0x000338, "Member 'ABP_FarRotatorCloud_C::VolumeCloudFade' has a wrong offset!");

}

