#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FarRotatorCloud

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FarRotatorCloud.BP_FarRotatorCloud_C.ExecuteUbergraph_BP_FarRotatorCloud
// 0x0014 (0x0014 - 0x0000)
struct BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud) == 0x000004, "Wrong alignment on BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud");
static_assert(sizeof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud) == 0x000014, "Wrong size on BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud");
static_assert(offsetof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud, EntryPoint) == 0x000000, "Member 'BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud, K2Node_Event_DeltaSeconds_1) == 0x000004, "Member 'BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud::K2Node_Event_DeltaSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_FarRotatorCloud_C_ExecuteUbergraph_BP_FarRotatorCloud::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_FarRotatorCloud.BP_FarRotatorCloud_C.EditorTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FarRotatorCloud_C_EditorTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FarRotatorCloud_C_EditorTick) == 0x000004, "Wrong alignment on BP_FarRotatorCloud_C_EditorTick");
static_assert(sizeof(BP_FarRotatorCloud_C_EditorTick) == 0x000004, "Wrong size on BP_FarRotatorCloud_C_EditorTick");
static_assert(offsetof(BP_FarRotatorCloud_C_EditorTick, DeltaSeconds) == 0x000000, "Member 'BP_FarRotatorCloud_C_EditorTick::DeltaSeconds' has a wrong offset!");

// Function BP_FarRotatorCloud.BP_FarRotatorCloud_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FarRotatorCloud_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FarRotatorCloud_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FarRotatorCloud_C_ReceiveTick");
static_assert(sizeof(BP_FarRotatorCloud_C_ReceiveTick) == 0x000004, "Wrong size on BP_FarRotatorCloud_C_ReceiveTick");
static_assert(offsetof(BP_FarRotatorCloud_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FarRotatorCloud_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FarRotatorCloud.BP_FarRotatorCloud_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_FarRotatorCloud_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FarRotatorCloud_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FarRotatorCloud_C_UserConstructionScript");
static_assert(sizeof(BP_FarRotatorCloud_C_UserConstructionScript) == 0x000020, "Wrong size on BP_FarRotatorCloud_C_UserConstructionScript");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000018, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000019, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FarRotatorCloud_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x00001A, "Member 'BP_FarRotatorCloud_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");

}

