#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Input_SA1Guyingxiongkai

#include "Basic.hpp"

#include "sInputCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.攻击按下
// 0x0078 (0x0078 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_攻击按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_攻击按下) == 0x000008, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_攻击按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_攻击按下) == 0x000078, "Wrong size on BP_Input_SA1Guyingxiongkai_C_攻击按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000048, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000058, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_CanResponseInput_ReturnValue) == 0x000059, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000060, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击按下, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000070, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击按下::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.攻击长按
// 0x0030 (0x0030 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_攻击长按 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_攻击长按) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_攻击长按");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_攻击长按) == 0x000030, "Wrong size on BP_Input_SA1Guyingxiongkai_C_攻击长按");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击长按, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击长按::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击长按, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击长按::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击长按, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击长按::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击长按, CallFunc_CanResponseInput_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击长按::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.攻击抬起
// 0x0060 (0x0060 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_攻击抬起 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_攻击抬起) == 0x000008, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_攻击抬起");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_攻击抬起) == 0x000060, "Wrong size on BP_Input_SA1Guyingxiongkai_C_攻击抬起");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc_CanResponseInput_ReturnValue) == 0x000041, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000048, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_攻击抬起, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000058, "Member 'BP_Input_SA1Guyingxiongkai_C_攻击抬起::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.技能1按下
// 0x0030 (0x0030 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_技能1按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc___1___ReturnValue;                        // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_技能1按下) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_技能1按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_技能1按下) == 0x000030, "Wrong size on BP_Input_SA1Guyingxiongkai_C_技能1按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1按下, CallFunc___1___ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1按下::CallFunc___1___ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1按下, CallFunc_CanResponseInput_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1按下::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.技能1长按
// 0x0030 (0x0030 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_技能1长按 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc___1___ReturnValue;                        // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_技能1长按) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_技能1长按");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_技能1长按) == 0x000030, "Wrong size on BP_Input_SA1Guyingxiongkai_C_技能1长按");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1长按, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1长按::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1长按, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1长按::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1长按, CallFunc___1___ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1长按::CallFunc___1___ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1长按, CallFunc_CanResponseInput_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1长按::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.技能1抬起
// 0x0030 (0x0030 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_技能1抬起 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc___1___ReturnValue;                        // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_技能1抬起) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_技能1抬起");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_技能1抬起) == 0x000030, "Wrong size on BP_Input_SA1Guyingxiongkai_C_技能1抬起");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1抬起, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1抬起::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1抬起, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1抬起::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1抬起, CallFunc___1___ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1抬起::CallFunc___1___ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_技能1抬起, CallFunc_CanResponseInput_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_技能1抬起::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.瞄准按下
// 0x0030 (0x0030 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_瞄准按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_瞄准按下) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_瞄准按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_瞄准按下) == 0x000030, "Wrong size on BP_Input_SA1Guyingxiongkai_C_瞄准按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_瞄准按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_瞄准按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_瞄准按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_瞄准按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_瞄准按下, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_瞄准按下::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_瞄准按下, CallFunc_CanResponseInput_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_瞄准按下::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.幻象2按下
// 0x002C (0x002C - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_幻象2按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc___2___ReturnValue;                        // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_幻象2按下) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_幻象2按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_幻象2按下) == 0x00002C, "Wrong size on BP_Input_SA1Guyingxiongkai_C_幻象2按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_幻象2按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_幻象2按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_幻象2按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_幻象2按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_幻象2按下, CallFunc___2___ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_幻象2按下::CallFunc___2___ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.大招按下
// 0x002C (0x002C - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_大招按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_大招按下) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_大招按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_大招按下) == 0x00002C, "Wrong size on BP_Input_SA1Guyingxiongkai_C_大招按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_大招按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_大招按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_大招按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_大招按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_大招按下, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_大招按下::CallFunc______ReturnValue' has a wrong offset!");

// Function BP_Input_SA1Guyingxiongkai.BP_Input_SA1Guyingxiongkai_C.闪避按下
// 0x0040 (0x0040 - 0x0000)
struct BP_Input_SA1Guyingxiongkai_C_闪避按下 final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc_CreateSkillCommand_ReturnValue;           // 0x002C(0x0014)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Input_SA1Guyingxiongkai_C_闪避按下) == 0x000004, "Wrong alignment on BP_Input_SA1Guyingxiongkai_C_闪避按下");
static_assert(sizeof(BP_Input_SA1Guyingxiongkai_C_闪避按下) == 0x000040, "Wrong size on BP_Input_SA1Guyingxiongkai_C_闪避按下");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_闪避按下, time) == 0x000000, "Member 'BP_Input_SA1Guyingxiongkai_C_闪避按下::time' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_闪避按下, ReturnValue) == 0x000004, "Member 'BP_Input_SA1Guyingxiongkai_C_闪避按下::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_闪避按下, CallFunc______ReturnValue) == 0x000018, "Member 'BP_Input_SA1Guyingxiongkai_C_闪避按下::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_SA1Guyingxiongkai_C_闪避按下, CallFunc_CreateSkillCommand_ReturnValue) == 0x00002C, "Member 'BP_Input_SA1Guyingxiongkai_C_闪避按下::CallFunc_CreateSkillCommand_ReturnValue' has a wrong offset!");

}

