#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LeavesInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.ExecuteUbergraph_BP_LeavesInteraction
// 0x0040 (0x0040 - 0x0000)
struct BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          K2Node_CustomEvent_OriginPoint;                    // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SceneBattleInteract_C*              K2Node_CustomEvent_Config;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Id;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction");
static_assert(sizeof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction) == 0x000040, "Wrong size on BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, EntryPoint) == 0x000000, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, K2Node_CustomEvent_OriginPoint) == 0x000008, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::K2Node_CustomEvent_OriginPoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, K2Node_CustomEvent_Config) == 0x000020, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::K2Node_CustomEvent_Config' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, K2Node_CustomEvent_Id) == 0x000028, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::K2Node_CustomEvent_Id' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x000030, "Member 'BP_LeavesInteraction_C_ExecuteUbergraph_BP_LeavesInteraction::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.OnWeaponInteraction
// 0x0028 (0x0028 - 0x0000)
struct BP_LeavesInteraction_C_OnWeaponInteraction final
{
public:
	struct FVectorDouble                          OriginPoint;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SceneBattleInteract_C*              Config;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Id;                                                // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_OnWeaponInteraction) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_OnWeaponInteraction");
static_assert(sizeof(BP_LeavesInteraction_C_OnWeaponInteraction) == 0x000028, "Wrong size on BP_LeavesInteraction_C_OnWeaponInteraction");
static_assert(offsetof(BP_LeavesInteraction_C_OnWeaponInteraction, OriginPoint) == 0x000000, "Member 'BP_LeavesInteraction_C_OnWeaponInteraction::OriginPoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_OnWeaponInteraction, Config) == 0x000018, "Member 'BP_LeavesInteraction_C_OnWeaponInteraction::Config' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_OnWeaponInteraction, Id) == 0x000020, "Member 'BP_LeavesInteraction_C_OnWeaponInteraction::Id' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LeavesInteraction_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LeavesInteraction_C_ReceiveTick");
static_assert(sizeof(BP_LeavesInteraction_C_ReceiveTick) == 0x000004, "Wrong size on BP_LeavesInteraction_C_ReceiveTick");
static_assert(offsetof(BP_LeavesInteraction_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LeavesInteraction_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.InitParam
// 0x0028 (0x0028 - 0x0000)
struct BP_LeavesInteraction_C_InitParam final
{
public:
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_WD_WorldToLocal_ReturnValue;              // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_InitParam) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_InitParam");
static_assert(sizeof(BP_LeavesInteraction_C_InitParam) == 0x000028, "Wrong size on BP_LeavesInteraction_C_InitParam");
static_assert(offsetof(BP_LeavesInteraction_C_InitParam, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_LeavesInteraction_C_InitParam::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_InitParam, CallFunc_WD_WorldToLocal_ReturnValue) == 0x000018, "Member 'BP_LeavesInteraction_C_InitParam::CallFunc_WD_WorldToLocal_ReturnValue' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.UpdateParam
// 0x0058 (0x0058 - 0x0000)
struct BP_LeavesInteraction_C_UpdateParam final
{
public:
	float                                         dt;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue;       // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue;       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue_1;     // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue_1;     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LeavesInteraction_C_UpdateParam) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_UpdateParam");
static_assert(sizeof(BP_LeavesInteraction_C_UpdateParam) == 0x000058, "Wrong size on BP_LeavesInteraction_C_UpdateParam");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, dt) == 0x000000, "Member 'BP_LeavesInteraction_C_UpdateParam::dt' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_GetWorldOriginLocation_ReturnValue) == 0x000004, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_GetWorldOriginLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Conv_IntVectorToVector_ReturnValue) == 0x000010, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Conv_IntVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_GetWorldOriginLocation_ReturnValue_1) == 0x00001C, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_GetWorldOriginLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Conv_IntVectorToVector_ReturnValue_1) == 0x000034, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Conv_IntVectorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_GetPlayerPawn_ReturnValue) == 0x000048, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Abs_ReturnValue) == 0x000050, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_UpdateParam, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000055, "Member 'BP_LeavesInteraction_C_UpdateParam::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.WeaponData
// 0x0040 (0x0040 - 0x0000)
struct BP_LeavesInteraction_C_WeaponData final
{
public:
	struct FVector                                tempVel;                                           // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_WeaponData) == 0x000004, "Wrong alignment on BP_LeavesInteraction_C_WeaponData");
static_assert(sizeof(BP_LeavesInteraction_C_WeaponData) == 0x000040, "Wrong size on BP_LeavesInteraction_C_WeaponData");
static_assert(offsetof(BP_LeavesInteraction_C_WeaponData, tempVel) == 0x000000, "Member 'BP_LeavesInteraction_C_WeaponData::tempVel' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_WeaponData, CallFunc_MakeLiteralName_ReturnValue) == 0x00000C, "Member 'BP_LeavesInteraction_C_WeaponData::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_WeaponData, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000018, "Member 'BP_LeavesInteraction_C_WeaponData::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_WeaponData, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'BP_LeavesInteraction_C_WeaponData::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_WeaponData, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'BP_LeavesInteraction_C_WeaponData::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.Choose Available Point
// 0x0058 (0x0058 - 0x0000)
struct BP_LeavesInteraction_C_Choose_Available_Point final
{
public:
	struct FVectorDouble                          CollisionPoint;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          WeaponPoint;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SceneBattleInteract_C*              ConfigDA;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          AvailblePoint;                                     // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LeavesInteraction_C_Choose_Available_Point) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_Choose_Available_Point");
static_assert(sizeof(BP_LeavesInteraction_C_Choose_Available_Point) == 0x000058, "Wrong size on BP_LeavesInteraction_C_Choose_Available_Point");
static_assert(offsetof(BP_LeavesInteraction_C_Choose_Available_Point, CollisionPoint) == 0x000000, "Member 'BP_LeavesInteraction_C_Choose_Available_Point::CollisionPoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Choose_Available_Point, WeaponPoint) == 0x000018, "Member 'BP_LeavesInteraction_C_Choose_Available_Point::WeaponPoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Choose_Available_Point, ConfigDA) == 0x000030, "Member 'BP_LeavesInteraction_C_Choose_Available_Point::ConfigDA' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Choose_Available_Point, AvailblePoint) == 0x000038, "Member 'BP_LeavesInteraction_C_Choose_Available_Point::AvailblePoint' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Choose_Available_Point, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_LeavesInteraction_C_Choose_Available_Point::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.Debug
// 0x0080 (0x0080 - 0x0000)
struct BP_LeavesInteraction_C_Debug final
{
public:
	class FString                                 CallFunc_Conv_ColorToString_ReturnValue;           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_2;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_Debug) == 0x000008, "Wrong alignment on BP_LeavesInteraction_C_Debug");
static_assert(sizeof(BP_LeavesInteraction_C_Debug) == 0x000080, "Wrong size on BP_LeavesInteraction_C_Debug");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Conv_ColorToString_ReturnValue) == 0x000000, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Conv_ColorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Conv_VectorToString_ReturnValue) == 0x000010, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000040, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Conv_VectorToString_ReturnValue_2) == 0x000050, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Conv_VectorToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_Debug, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'BP_LeavesInteraction_C_Debug::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_LeavesInteraction.BP_LeavesInteraction_C.SetLeavesParameters
// 0x0060 (0x0060 - 0x0000)
struct BP_LeavesInteraction_C_SetLeavesParameters final
{
public:
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue;       // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LeavesInteraction_C_SetLeavesParameters) == 0x000010, "Wrong alignment on BP_LeavesInteraction_C_SetLeavesParameters");
static_assert(sizeof(BP_LeavesInteraction_C_SetLeavesParameters) == 0x000060, "Wrong size on BP_LeavesInteraction_C_SetLeavesParameters");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000000, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_MakeVector4_ReturnValue) == 0x000010, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_GetWorldOriginLocation_ReturnValue) == 0x000020, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_GetWorldOriginLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Conv_IntVectorToVector_ReturnValue) == 0x00002C, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Conv_IntVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000044, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000048, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00004C, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LeavesInteraction_C_SetLeavesParameters, CallFunc_MakeVector4_ReturnValue_1) == 0x000050, "Member 'BP_LeavesInteraction_C_SetLeavesParameters::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");

}

