#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LightModel.BP_LightModel_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_LightModel_C_UserConstructionScript final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightModel_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_LightModel_C_UserConstructionScript");
static_assert(sizeof(BP_LightModel_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_LightModel_C_UserConstructionScript");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_LightModel_C_UserConstructionScript::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, ___int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_LightModel_C_UserConstructionScript::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue_1) == 0x000014, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue_2) == 0x000018, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetMaterials_ReturnValue) == 0x000020, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, K2Node_DynamicCast_As______) == 0x000040, "Member 'BP_LightModel_C_UserConstructionScript::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_LightModel_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000064, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_EndsWith_ReturnValue) == 0x000080, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_EndsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000088, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue_1) == 0x000098, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue_1) == 0x0000A8, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B0, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x0000BC, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000C0, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue_2) == 0x0000C8, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D8, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000DC, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightModel_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0000E8, "Member 'BP_LightModel_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");

}

