#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlantGrowthController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlantGrowthController.BP_PlantGrowthController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlantGrowthController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlantGrowthController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlantGrowthController_C_ReceiveTick");
static_assert(sizeof(BP_PlantGrowthController_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlantGrowthController_C_ReceiveTick");
static_assert(offsetof(BP_PlantGrowthController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlantGrowthController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlantGrowthController.BP_PlantGrowthController_C.EditorTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlantGrowthController_C_EditorTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlantGrowthController_C_EditorTick) == 0x000004, "Wrong alignment on BP_PlantGrowthController_C_EditorTick");
static_assert(sizeof(BP_PlantGrowthController_C_EditorTick) == 0x000004, "Wrong size on BP_PlantGrowthController_C_EditorTick");
static_assert(offsetof(BP_PlantGrowthController_C_EditorTick, DeltaSeconds) == 0x000000, "Member 'BP_PlantGrowthController_C_EditorTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlantGrowthController.BP_PlantGrowthController_C.ExecuteUbergraph_BP_PlantGrowthController
// 0x0160 (0x0160 - 0x0000)
struct BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetComponentLocation_ReturnValue;    // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue;    // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetComponentLocation_ReturnValue_1;  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_FloatToLinearColor_ReturnValue;      // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_FloatToLinearColor_ReturnValue_1;    // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController) == 0x000008, "Wrong alignment on BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController");
static_assert(sizeof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController) == 0x000160, "Wrong size on BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, EntryPoint) == 0x000000, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_D_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_D_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x000020, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00002C, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_VectorToVectorDouble_ReturnValue) == 0x000038, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_VectorToVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, K2Node_Event_DeltaSeconds_1) == 0x000050, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::K2Node_Event_DeltaSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000058, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_D_K2_GetComponentLocation_ReturnValue_1) == 0x000090, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_D_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_GetVectorParameterValue_ReturnValue) == 0x0000A8, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_BooleanOR_ReturnValue) == 0x0000B8, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000BC, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000C8, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000CC, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_VSize_ReturnValue) == 0x0000D8, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_FMin_ReturnValue) == 0x0000E0, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Normal_ReturnValue) == 0x0000E4, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000F0, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_FloatToLinearColor_ReturnValue) == 0x0000FC, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_FloatToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Add_VectorVector_ReturnValue) == 0x00010C, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_VLerp_ReturnValue) == 0x000118, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_BreakVector_X) == 0x000124, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_BreakVector_Y) == 0x000128, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_BreakVector_Z) == 0x00012C, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, K2Node_MakeStruct_LinearColor) == 0x000130, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_BooleanOR_ReturnValue_1) == 0x000140, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000144, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000148, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController, CallFunc_Conv_FloatToLinearColor_ReturnValue_1) == 0x00014C, "Member 'BP_PlantGrowthController_C_ExecuteUbergraph_BP_PlantGrowthController::CallFunc_Conv_FloatToLinearColor_ReturnValue_1' has a wrong offset!");

}

