#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolumetricLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VolumetricLight.BP_VolumetricLight_C.ExecuteUbergraph_BP_VolumetricLight
// 0x000C (0x000C - 0x0000)
struct BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaleFactor;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight) == 0x000004, "Wrong alignment on BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight");
static_assert(sizeof(BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight) == 0x00000C, "Wrong size on BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight");
static_assert(offsetof(BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight, EntryPoint) == 0x000000, "Member 'BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight, K2Node_Event_ScaleFactor) == 0x000004, "Member 'BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight::K2Node_Event_ScaleFactor' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_VolumetricLight_C_ExecuteUbergraph_BP_VolumetricLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_VolumetricLight.BP_VolumetricLight_C.SetLightIntensityScale
// 0x0004 (0x0004 - 0x0000)
struct BP_VolumetricLight_C_SetLightIntensityScale final
{
public:
	float                                         ScaleFactor;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricLight_C_SetLightIntensityScale) == 0x000004, "Wrong alignment on BP_VolumetricLight_C_SetLightIntensityScale");
static_assert(sizeof(BP_VolumetricLight_C_SetLightIntensityScale) == 0x000004, "Wrong size on BP_VolumetricLight_C_SetLightIntensityScale");
static_assert(offsetof(BP_VolumetricLight_C_SetLightIntensityScale, ScaleFactor) == 0x000000, "Member 'BP_VolumetricLight_C_SetLightIntensityScale::ScaleFactor' has a wrong offset!");

// Function BP_VolumetricLight.BP_VolumetricLight_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BP_VolumetricLight_C_UserConstructionScript final
{
public:
	struct FTransform                             ___struct_Variable;                                // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VolumetricLight_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_VolumetricLight_C_UserConstructionScript");
static_assert(sizeof(BP_VolumetricLight_C_UserConstructionScript) == 0x000060, "Wrong size on BP_VolumetricLight_C_UserConstructionScript");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, ___struct_Variable) == 0x000000, "Member 'BP_VolumetricLight_C_UserConstructionScript::___struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000040, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000048, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000050, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VolumetricLight_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000058, "Member 'BP_VolumetricLight_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

