#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Burst01_Jinxi_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C.ExecuteUbergraph_GA_Burst01_Jinxi_Base
// 0x07A0 (0x07A0 - 0x0000)
struct GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc___ID____Buff_____;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;  // 0x0010(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0038(0x00B8)()
	struct FGameplayEventData                     ___struct_Variable;                                // 0x00F0(0x00B8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D0(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0220(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0248(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc__________;                                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x0280(0x00B8)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0358(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0420(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________1;                              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0480(0x0020)()
	struct FGameplayTag                           ___struct_Variable_2;                              // 0x04A0(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio;                      // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0500(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________6;                              // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0540(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA_______________1;                   // 0x0590(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x05A0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x05D8(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________7;                              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x060C(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0618(0x0020)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_11;         // 0x0640(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0668(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________9;                              // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x06C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayCameraSequence_ReturnValue;           // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_722[0x6];                                      // 0x0722(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0738(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc___ID____Buff______1;                      // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792[0x6];                                      // 0x0792(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________23;                             // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base) == 0x000008, "Wrong alignment on GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base");
static_assert(sizeof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base) == 0x0007A0, "Wrong size on GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, EntryPoint) == 0x000000, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___ID____Buff_____) == 0x000004, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___ID____Buff_____' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CustomEvent_Payload) == 0x000038, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, ___struct_Variable) == 0x0000F0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000220, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000248, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000270, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc__________) == 0x000278, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, ___struct_Variable_1) == 0x000280, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetDisplayName_ReturnValue) == 0x000338, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetObjectClass_ReturnValue) == 0x000348, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000350, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CustomEvent_Payload_1) == 0x000358, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_____GA______________) == 0x000410, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_6) == 0x000420, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_Conv_NameToString_ReturnValue) == 0x000448, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________1) == 0x000458, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue) == 0x000460, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000468, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_DynamicCast_AsTs_Base_Character) == 0x000470, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_DynamicCast_bSuccess) == 0x000478, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000480, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, ___struct_Variable_2) == 0x0004A0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________2) == 0x0004B0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc__________SpeedRatio) == 0x0004B8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc______________) == 0x0004BC, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________3) == 0x0004C0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_______________1) == 0x0004C8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________4) == 0x0004D0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________5) == 0x0004D8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_______________2) == 0x0004E0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0004E8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0004F0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_DynamicCast_bSuccess_1) == 0x0004F8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_7) == 0x000500, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000528, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________6) == 0x000530, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000538, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_8) == 0x000540, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_1) == 0x000568, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetDisplayName_ReturnValue_1) == 0x000570, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_GetObjectClass_ReturnValue_1) == 0x000580, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000588, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_____GA_______________1) == 0x000590, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_9) == 0x0005A0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0005C8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005D8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________7) == 0x000600, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_2) == 0x000608, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CustomEvent_Tag) == 0x00060C, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000618, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________8) == 0x000638, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_11) == 0x000640, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_CreateDelegate_OutputDelegate_12) == 0x000668, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, K2Node_Event_bWasCancelled) == 0x000690, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________9) == 0x000698, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_3) == 0x0006A0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________10) == 0x0006A8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________11) == 0x0006B0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0006B8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0006C0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0006D0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_4) == 0x0006D1, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________12) == 0x0006D8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_______________3) == 0x0006E0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________13) == 0x0006E8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_____ID___ID) == 0x0006F0, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________14) == 0x0006F8, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_PlayCameraSequence_ReturnValue) == 0x000700, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_PlayCameraSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc__________SpeedRatio_1) == 0x000704, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________15) == 0x000708, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000710, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000718, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_5) == 0x000720, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_6) == 0x000721, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________16) == 0x000728, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________17) == 0x000730, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000738, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000748, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________18) == 0x000750, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________19) == 0x000758, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________20) == 0x000760, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000768, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_IsValid_ReturnValue_7) == 0x000770, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________21) == 0x000778, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________21' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___ID____Buff______1) == 0x000780, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___ID____Buff______1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________22) == 0x000788, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________22' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000790, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc_BooleanOR_ReturnValue) == 0x000791, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base, CallFunc___________23) == 0x000798, "Member 'GA_Burst01_Jinxi_Base_C_ExecuteUbergraph_GA_Burst01_Jinxi_Base::CallFunc___________23' has a wrong offset!");

// Function GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Burst01_Jinxi_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Burst01_Jinxi_Base_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Burst01_Jinxi_Base_C_K2_OnEndAbility");
static_assert(sizeof(GA_Burst01_Jinxi_Base_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Burst01_Jinxi_Base_C_K2_OnEndAbility");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Burst01_Jinxi_Base_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C.EventReceived_18B59F5945020DB23C42FD881871D5DC
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC) == 0x000008, "Wrong alignment on GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC");
static_assert(sizeof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC) == 0x0000B8, "Wrong size on GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC, Payload) == 0x000000, "Member 'GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD881871D5DC::Payload' has a wrong offset!");

// Function GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C.EventReceived_18B59F5945020DB23C42FD883E7527A5
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5) == 0x000008, "Wrong alignment on GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5");
static_assert(sizeof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5) == 0x0000B8, "Wrong size on GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5, Payload) == 0x000000, "Member 'GA_Burst01_Jinxi_Base_C_EventReceived_18B59F5945020DB23C42FD883E7527A5::Payload' has a wrong offset!");

// Function GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C.Added_21071CB943CD992BF8EFD6A3C396F32C
// 0x000C (0x000C - 0x0000)
struct GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C) == 0x000004, "Wrong alignment on GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C");
static_assert(sizeof(GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C) == 0x00000C, "Wrong size on GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C");
static_assert(offsetof(GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C, Tag) == 0x000000, "Member 'GA_Burst01_Jinxi_Base_C_Added_21071CB943CD992BF8EFD6A3C396F32C::Tag' has a wrong offset!");

}

