#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Burst01_Jinxi_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SSequenceCamera_Settings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Burst01_Jinxi_Base.GA_Burst01_Jinxi_Base_C
// 0x0060 (0x05C8 - 0x0568)
class UGA_Burst01_Jinxi_Base_C : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Burst01_Jinxi_Base_C;            // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSSequenceCamera_Settings              特写镜头配置;                                      // 0x0570(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               Additive_Rotation;                                 // 0x05A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Socket_Name;                                       // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Burst01_Jinxi_Base(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E815C569CD0();
	void OnBlendOut_5D118C384AE61F1C80292E815C569CD0();
	void OnInterrupted_5D118C384AE61F1C80292E815C569CD0();
	void OnCancelled_5D118C384AE61F1C80292E815C569CD0();
	void OnTick_5D118C384AE61F1C80292E815C569CD0();
	void EventReceived_18B59F5945020DB23C42FD881871D5DC(const struct FGameplayEventData& Payload);
	void EventReceived_18B59F5945020DB23C42FD883E7527A5(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E81C57F1D0E();
	void OnBlendOut_5D118C384AE61F1C80292E81C57F1D0E();
	void OnInterrupted_5D118C384AE61F1C80292E81C57F1D0E();
	void OnCancelled_5D118C384AE61F1C80292E81C57F1D0E();
	void OnTick_5D118C384AE61F1C80292E81C57F1D0E();
	void Added_21071CB943CD992BF8EFD6A3C396F32C(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Burst01_Jinxi_Base_C">();
	}
	static class UGA_Burst01_Jinxi_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Burst01_Jinxi_Base_C>();
	}
};
static_assert(alignof(UGA_Burst01_Jinxi_Base_C) == 0x000008, "Wrong alignment on UGA_Burst01_Jinxi_Base_C");
static_assert(sizeof(UGA_Burst01_Jinxi_Base_C) == 0x0005C8, "Wrong size on UGA_Burst01_Jinxi_Base_C");
static_assert(offsetof(UGA_Burst01_Jinxi_Base_C, UberGraphFrame_GA_Burst01_Jinxi_Base_C) == 0x000568, "Member 'UGA_Burst01_Jinxi_Base_C::UberGraphFrame_GA_Burst01_Jinxi_Base_C' has a wrong offset!");
static_assert(offsetof(UGA_Burst01_Jinxi_Base_C, 特写镜头配置) == 0x000570, "Member 'UGA_Burst01_Jinxi_Base_C::特写镜头配置' has a wrong offset!");
static_assert(offsetof(UGA_Burst01_Jinxi_Base_C, Additive_Rotation) == 0x0005A8, "Member 'UGA_Burst01_Jinxi_Base_C::Additive_Rotation' has a wrong offset!");
static_assert(offsetof(UGA_Burst01_Jinxi_Base_C, Socket_Name) == 0x0005B8, "Member 'UGA_Burst01_Jinxi_Base_C::Socket_Name' has a wrong offset!");

}

