#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Comboo_SuiGuang_Vision_2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2
// 0x0610 (0x0610 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;            // 0x0008(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0030(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable;                                // 0x003C(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0048(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0070(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x007C(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0088(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00B0(0x00B8)()
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x0168(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0230(0x0028)(ZeroConstructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0268(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio;                      // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_3;                              // 0x02E8(0x00B8)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________3;                              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x03B0(0x00B8)()
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0498(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_____GA______________;                     // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________4;                              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonerEntityId_ReturnValue;          // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0508(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc____________;                              // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID_1;                            // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0568(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0598(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x05E8(0x0028)(ZeroConstructor)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2) == 0x000610, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, EntryPoint) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CustomEvent_Tag_1) == 0x000030, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, ___struct_Variable) == 0x00003C, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CustomEvent_Tag) == 0x000070, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, ___struct_Variable_1) == 0x00007C, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CustomEvent_Payload) == 0x0000B0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, ___struct_Variable_2) == 0x000168, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000220, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000230, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_WaitDelay_ReturnValue) == 0x000258, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_1) == 0x000260, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_4) == 0x000268, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc__________SpeedRatio) == 0x000290, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc__________) == 0x000298, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc______________) == 0x0002A0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________1) == 0x0002A8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________2) == 0x0002B0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_______________1) == 0x0002B8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002C0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_DynamicCast_AsTs_Base_Character) == 0x0002C8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002D8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_2) == 0x0002E0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, ___struct_Variable_3) == 0x0002E8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0003A0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________3) == 0x0003A8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CustomEvent_Payload_1) == 0x0003B0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000468, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_3) == 0x000470, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_GetDisplayName_ReturnValue) == 0x000478, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_GetObjectClass_ReturnValue) == 0x000488, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000490, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_5) == 0x000498, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_Conv_NameToString_ReturnValue) == 0x0004C0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_____GA______________) == 0x0004D0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________4) == 0x0004E0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_4) == 0x0004E8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________5) == 0x0004F0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________6) == 0x0004F8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_____ID___ID) == 0x000500, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_GetSummonerEntityId_ReturnValue) == 0x000504, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_GetSummonerEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_6) == 0x000508, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_____ID_______) == 0x000530, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_____ID___________) == 0x000538, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc____________) == 0x000540, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_5) == 0x000548, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000550, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_DynamicCast_bSuccess_1) == 0x000558, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_____ID___ID_1) == 0x00055C, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________7) == 0x000560, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_7) == 0x000568, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc___________8) == 0x000590, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_8) == 0x000598, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_Event_bWasCancelled) == 0x0005C0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0005C8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_6) == 0x0005D0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0005D8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, CallFunc_IsValid_ReturnValue_7) == 0x0005E0, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2, K2Node_CreateDelegate_OutputDelegate_9) == 0x0005E8, "Member 'GA_Comboo_SuiGuang_Vision_2_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision_2::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.EventReceived_18B59F5945020DB23C42FD8867E972D0
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0) == 0x0000B8, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0, Payload) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD8867E972D0::Payload' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.Added_21071CB943CD992BF8EFD6A3D9CFFA98
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98) == 0x000004, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98) == 0x00000C, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98, Tag) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3D9CFFA98::Tag' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.Added_21071CB943CD992BF8EFD6A3459978C1
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1) == 0x000004, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1) == 0x00000C, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1, Tag) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_Added_21071CB943CD992BF8EFD6A3459978C1::Tag' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.EventReceived_18B59F5945020DB23C42FD88097AAFBB
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB) == 0x0000B8, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB, Payload) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_EventReceived_18B59F5945020DB23C42FD88097AAFBB::Payload' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision_2.GA_Comboo_SuiGuang_Vision_2_C.显示玩家模型
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型 final
{
public:
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型) == 0x000001, "Wrong alignment on GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型) == 0x000001, "Wrong size on GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型, CallFunc_GetIsInGame_ReturnValue) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_2_C_显示玩家模型::CallFunc_GetIsInGame_ReturnValue' has a wrong offset!");

}

