#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Comboo_SuiGuang_Vision

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SHitInformation_structs.hpp"


namespace SDK::Params
{

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.ExecuteUbergraph_GA_Comboo_SuiGuang_Vision
// 0x10D8 (0x10D8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable;                                // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00D8(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0190(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x01B8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATsBaseCharacter_C* 角色, const struct FSHitInformation& 受击数据)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0280(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02A8(0x0028)(ZeroConstructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x030C(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_8;          // 0x0320(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________2;                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_2;                              // 0x0350(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0390(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________3;                              // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_9;          // 0x03B8(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x03E8(0x00B8)()
	bool                                          ___bool_IsClosed_Variable;                         // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_10; // 0x04A8(0x0028)(ZeroConstructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonerEntityId_ReturnValue;          // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_3;                              // 0x0510(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x3];                                      // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc____________;                              // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID_1;                            // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ___struct_Variable_4;                              // 0x0618(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x06D8(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_11; // 0x07A0(0x0028)(ZeroConstructor)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EventManager_C*                     CallFunc________________;                          // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_CustomEvent___;                             // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       K2Node_CustomEvent_____;                           // 0x07F8(0x08C8)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x10C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x10C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x10C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C3[0x5];                                     // 0x10C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x10C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision) == 0x0010D8, "Wrong size on GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, EntryPoint) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___struct_Variable) == 0x000004, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_Payload) == 0x0000D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_5) == 0x000190, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___struct_Variable_1) == 0x0001B8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000270, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_6) == 0x000280, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002A8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitDelay_ReturnValue) == 0x0002D0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc__________) == 0x0002D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_1) == 0x0002E0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________1) == 0x0002E8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc______________) == 0x0002F0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002F8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_DynamicCast_AsTs_Base_Character) == 0x000300, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_Tag) == 0x00030C, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000318, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_8) == 0x000320, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________2) == 0x000348, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___struct_Variable_2) == 0x000350, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_GetDisplayName_ReturnValue) == 0x000360, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_GetObjectClass_ReturnValue) == 0x000370, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000378, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_____GA______________) == 0x000380, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_Tag_1) == 0x000390, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_Conv_NameToString_ReturnValue) == 0x0003A0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________3) == 0x0003B0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003B8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_2) == 0x0003E0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_Payload_1) == 0x0003E8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___bool_IsClosed_Variable) == 0x0004A0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_10) == 0x0004A8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___bool_Has_Been_Initd_Variable) == 0x0004D0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________4) == 0x0004D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0004E0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_______________1) == 0x0004E8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_3) == 0x0004E9, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________5) == 0x0004F0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_____ID___ID) == 0x0004F8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________6) == 0x000500, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_GetSummonerEntityId_ReturnValue) == 0x000508, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_GetSummonerEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___struct_Variable_3) == 0x000510, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_____ID_______) == 0x0005C8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_____ID___________) == 0x0005D0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc__________SpeedRatio) == 0x0005D4, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0005D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_4) == 0x0005E0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc____________) == 0x0005E8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_5) == 0x0005F0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0005F8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_DynamicCast_bSuccess_1) == 0x000600, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_____ID___ID_1) == 0x000604, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________7) == 0x000608, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000610, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, ___struct_Variable_4) == 0x000618, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::___struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_6) == 0x0006D0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_Payload_2) == 0x0006D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc___________8) == 0x000790, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_Event_bWasCancelled) == 0x000798, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CreateDelegate_OutputDelegate_11) == 0x0007A0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0007C8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_7) == 0x0007D0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0007D8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_IsValid_ReturnValue_8) == 0x0007E0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc________________) == 0x0007E8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent___) == 0x0007F0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, K2Node_CustomEvent_____) == 0x0007F8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0010C0, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0010C1, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_BooleanOR_ReturnValue) == 0x0010C2, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision, CallFunc_Conv_IntToString_ReturnValue) == 0x0010C8, "Member 'GA_Comboo_SuiGuang_Vision_C_ExecuteUbergraph_GA_Comboo_SuiGuang_Vision::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.角色受击
// 0x08D0 (0x08D0 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_角色受击 final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       受击数据;                                          // 0x0008(0x08C8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_角色受击) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_角色受击");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_角色受击) == 0x0008D0, "Wrong size on GA_Comboo_SuiGuang_Vision_C_角色受击");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_角色受击, 角色) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_角色受击::角色' has a wrong offset!");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_角色受击, 受击数据) == 0x000008, "Member 'GA_Comboo_SuiGuang_Vision_C_角色受击::受击数据' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.EventReceived_18B59F5945020DB23C42FD8873132C0D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D) == 0x0000B8, "Wrong size on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D, Payload) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8873132C0D::Payload' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.Added_21071CB943CD992BF8EFD6A35163261C
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C) == 0x000004, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C) == 0x00000C, "Wrong size on GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C, Tag) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A35163261C::Tag' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.Added_21071CB943CD992BF8EFD6A3CD35A445
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445) == 0x000004, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445) == 0x00000C, "Wrong size on GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445, Tag) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_Added_21071CB943CD992BF8EFD6A3CD35A445::Tag' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.EventReceived_18B59F5945020DB23C42FD881D80F166
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166) == 0x0000B8, "Wrong size on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166, Payload) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD881D80F166::Payload' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.EventReceived_18B59F5945020DB23C42FD8865470148
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148) == 0x000008, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148) == 0x0000B8, "Wrong size on GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148, Payload) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_EventReceived_18B59F5945020DB23C42FD8865470148::Payload' has a wrong offset!");

// Function GA_Comboo_SuiGuang_Vision.GA_Comboo_SuiGuang_Vision_C.显示玩家模型
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_SuiGuang_Vision_C_显示玩家模型 final
{
public:
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_SuiGuang_Vision_C_显示玩家模型) == 0x000001, "Wrong alignment on GA_Comboo_SuiGuang_Vision_C_显示玩家模型");
static_assert(sizeof(GA_Comboo_SuiGuang_Vision_C_显示玩家模型) == 0x000001, "Wrong size on GA_Comboo_SuiGuang_Vision_C_显示玩家模型");
static_assert(offsetof(GA_Comboo_SuiGuang_Vision_C_显示玩家模型, CallFunc_GetIsInGame_ReturnValue) == 0x000000, "Member 'GA_Comboo_SuiGuang_Vision_C_显示玩家模型::CallFunc_GetIsInGame_ReturnValue' has a wrong offset!");

}

