#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Destroy_Bianshen_Tafang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Destroy_Bianshen_Tafang.GA_Destroy_Bianshen_Tafang_C
// 0x0040 (0x05A8 - 0x0568)
class UGA_Destroy_Bianshen_Tafang_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Destroy_Bianshen_Tafang_C;       // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         召唤者ID;                                          // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     召唤者;                                            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseVision_C*                       幻象BP;                                            // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                变身结束_粒子特效;                                 // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                变身结束_材质特效;                                 // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          主动结束;                                          // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         材质Handle;                                        // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          已结束;                                            // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Destroy_Bianshen_Tafang(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_18B59F5945020DB23C42FD888A053E5B(const struct FGameplayEventData& Payload);
	void EventReceived_18B59F5945020DB23C42FD88E496E330(const struct FGameplayEventData& Payload);
	void Added_21071CB943CD992BF8EFD6A3A875344A(const struct FGameplayTag& Tag);
	void Added_21071CB943CD992BF8EFD6A33423B613(const struct FGameplayTag& Tag);
	void OnCompleted_5D118C384AE61F1C80292E816AB68CC6();
	void OnBlendOut_5D118C384AE61F1C80292E816AB68CC6();
	void OnInterrupted_5D118C384AE61F1C80292E816AB68CC6();
	void OnCancelled_5D118C384AE61F1C80292E816AB68CC6();
	void OnTick_5D118C384AE61F1C80292E816AB68CC6();
	void 显示玩家模型();
	void 变身结束_碰撞关系处理();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Destroy_Bianshen_Tafang_C">();
	}
	static class UGA_Destroy_Bianshen_Tafang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Destroy_Bianshen_Tafang_C>();
	}
};
static_assert(alignof(UGA_Destroy_Bianshen_Tafang_C) == 0x000008, "Wrong alignment on UGA_Destroy_Bianshen_Tafang_C");
static_assert(sizeof(UGA_Destroy_Bianshen_Tafang_C) == 0x0005A8, "Wrong size on UGA_Destroy_Bianshen_Tafang_C");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, UberGraphFrame_GA_Destroy_Bianshen_Tafang_C) == 0x000568, "Member 'UGA_Destroy_Bianshen_Tafang_C::UberGraphFrame_GA_Destroy_Bianshen_Tafang_C' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 召唤者ID) == 0x000570, "Member 'UGA_Destroy_Bianshen_Tafang_C::召唤者ID' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 召唤者) == 0x000578, "Member 'UGA_Destroy_Bianshen_Tafang_C::召唤者' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 幻象BP) == 0x000580, "Member 'UGA_Destroy_Bianshen_Tafang_C::幻象BP' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 变身结束_粒子特效) == 0x000588, "Member 'UGA_Destroy_Bianshen_Tafang_C::变身结束_粒子特效' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 变身结束_材质特效) == 0x000590, "Member 'UGA_Destroy_Bianshen_Tafang_C::变身结束_材质特效' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 主动结束) == 0x000598, "Member 'UGA_Destroy_Bianshen_Tafang_C::主动结束' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 材质Handle) == 0x00059C, "Member 'UGA_Destroy_Bianshen_Tafang_C::材质Handle' has a wrong offset!");
static_assert(offsetof(UGA_Destroy_Bianshen_Tafang_C, 已结束) == 0x0005A0, "Member 'UGA_Destroy_Bianshen_Tafang_C::已结束' has a wrong offset!");

}

