#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ExitBS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_ExitBS.GA_ExitBS_C.ExecuteUbergraph_GA_ExitBS
// 0x0260 (0x0260 - 0x0000)
struct GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________2;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0028)(ZeroConstructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________3;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector__;                             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___1;                           // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y;                      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z;                      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue;    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___2;                           // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___3;                           // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_1;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_1;                    // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_1;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue_1;  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue_1;         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS) == 0x000008, "Wrong alignment on GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS");
static_assert(sizeof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS) == 0x000260, "Wrong size on GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, EntryPoint) == 0x000000, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc__________) == 0x000030, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________1) == 0x000038, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc______________) == 0x000040, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_DynamicCast_AsTs_Base_Character) == 0x000050, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________2) == 0x000090, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_GetDisplayName_ReturnValue) == 0x000098, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_GetObjectClass_ReturnValue) == 0x0000D0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000D8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_____GA______________) == 0x0000E0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_Conv_NameToString_ReturnValue) == 0x000118, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________3) == 0x000128, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_CreateDelegate_OutputDelegate_4) == 0x000130, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, K2Node_Event_bWasCancelled) == 0x000159, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________4) == 0x000160, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_____Vector__) == 0x000168, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_____Vector__' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_____Vector___1) == 0x000180, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_____Vector___1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_X) == 0x000198, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_X' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_Y) == 0x0001A0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_Y' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_Z) == 0x0001A8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_Z' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_D_EqualEqual_VectorVector_ReturnValue) == 0x0001B0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_D_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x0001B4, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_MakeRotator_ReturnValue) == 0x0001B8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________5) == 0x0001C8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________6) == 0x0001D0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_____Vector___2) == 0x0001D8, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_____Vector___2' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_____Vector___3) == 0x0001F0, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_____Vector___3' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_X_1) == 0x000208, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_X_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_Y_1) == 0x000210, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_Y_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_BreakVectorDouble_Z_1) == 0x000218, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_BreakVectorDouble_Z_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_D_EqualEqual_VectorVector_ReturnValue_1) == 0x000220, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_D_EqualEqual_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_Conv_DoubleToFloat_ReturnValue_1) == 0x000224, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_Conv_DoubleToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_MakeRotator_ReturnValue_1) == 0x000228, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________7) == 0x000238, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc___________8) == 0x000240, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_______________1) == 0x000248, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc__________SpeedRatio) == 0x00024C, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000250, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS, CallFunc_IsValid_ReturnValue_1) == 0x000258, "Member 'GA_ExitBS_C_ExecuteUbergraph_GA_ExitBS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_ExitBS.GA_ExitBS_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_ExitBS_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_ExitBS_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_ExitBS_C_K2_OnEndAbility");
static_assert(sizeof(GA_ExitBS_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_ExitBS_C_K2_OnEndAbility");
static_assert(offsetof(GA_ExitBS_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_ExitBS_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_ExitBS.GA_ExitBS_C.瞬移特效
// 0x0070 (0x0070 - 0x0000)
struct GA_ExitBS_C_瞬移特效 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_________ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ExitBS_C_瞬移特效) == 0x000010, "Wrong alignment on GA_ExitBS_C_瞬移特效");
static_assert(sizeof(GA_ExitBS_C_瞬移特效) == 0x000070, "Wrong size on GA_ExitBS_C_瞬移特效");
static_assert(offsetof(GA_ExitBS_C_瞬移特效, CallFunc__________) == 0x000000, "Member 'GA_ExitBS_C_瞬移特效::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_瞬移特效, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_ExitBS_C_瞬移特效::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_瞬移特效, CallFunc_MakeTransformDouble_ReturnValue) == 0x000020, "Member 'GA_ExitBS_C_瞬移特效::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ExitBS_C_瞬移特效, CallFunc_________ReturnValue) == 0x000060, "Member 'GA_ExitBS_C_瞬移特效::CallFunc_________ReturnValue' has a wrong offset!");

}

