#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HoldAttack_Miuwu_Vision

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision
// 0x06A0 (0x06A0 - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyDown_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ___struct_Variable;                                // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x0014(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate;            // 0x0020(0x0028)(ZeroConstructor)
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x0048(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0058(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0080(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_2;                              // 0x008C(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_2;          // 0x0098(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x00C0(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x00CC(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00D8(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0100(0x00B8)()
	struct FGameplayEventData                     ___struct_Variable_4;                              // 0x01B8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x027C(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_4;          // 0x0290(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc__________;                                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_5;                              // 0x02F0(0x00B8)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x03A8(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0460(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0480(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________1;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc______________;                            // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x2];                                      // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x04F8(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonerEntityId_ReturnValue;          // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_______________1;                          // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc____________;                              // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID_1;                            // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0580(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x05B0(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x05E0(0x0028)(ZeroConstructor)
	int32                                         CallFunc_____ID___ID_2;                            // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0628(0x0028)(ZeroConstructor)
	class AActor*                                 CallFunc_____________1;                            // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_____________2;                            // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____________3;                            // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67A[0x6];                                      // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0680(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision) == 0x000008, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision) == 0x0006A0, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, EntryPoint) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsKeyDown_ReturnValue) == 0x000004, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable) == 0x000008, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Tag_2) == 0x000014, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable_1) == 0x000048, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Tag_1) == 0x000080, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable_2) == 0x00008C, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Tag) == 0x0000C0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable_3) == 0x0000CC, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Payload) == 0x000100, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable_4) == 0x0001B8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000270, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Tag_3) == 0x00027C, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000288, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_4) == 0x000290, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc__________) == 0x0002B8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002C0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_GetDisplayName_ReturnValue) == 0x0002C8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_GetObjectClass_ReturnValue) == 0x0002E0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0002E8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___struct_Variable_5) == 0x0002F0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___struct_Variable_5' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CustomEvent_Payload_1) == 0x0003A8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____GA______________) == 0x000460, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_Conv_NameToString_ReturnValue) == 0x000470, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_5) == 0x000480, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________1) == 0x0004A8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_2) == 0x0004B0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________2) == 0x0004B8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___bool_IsClosed_Variable) == 0x0004C0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc______________) == 0x0004C1, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc__________SpeedRatio) == 0x0004C4, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, ___bool_Has_Been_Initd_Variable) == 0x0004C8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0004D0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_3) == 0x0004D8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0004E0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_DynamicCast_AsTs_Base_Character) == 0x0004E8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_DynamicCast_bSuccess) == 0x0004F0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004F8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________3) == 0x000520, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________4) == 0x000528, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____ID___ID) == 0x000530, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_GetSummonerEntityId_ReturnValue) == 0x000534, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_GetSummonerEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________5) == 0x000538, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____ID_______) == 0x000540, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____ID___________) == 0x000548, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_______________1) == 0x000549, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc____________) == 0x000550, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________6) == 0x000558, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_4) == 0x000560, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000568, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_DynamicCast_bSuccess_1) == 0x000570, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____ID___ID_1) == 0x000574, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________7) == 0x000578, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_7) == 0x000580, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc___________8) == 0x0005A8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_8) == 0x0005B0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_Event_bWasCancelled) == 0x0005D8, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_9) == 0x0005E0, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____ID___ID_2) == 0x000608, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____ID___ID_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000610, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x000618, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_5) == 0x000620, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_6) == 0x000621, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, K2Node_CreateDelegate_OutputDelegate_10) == 0x000628, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____________1) == 0x000650, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____________2) == 0x000658, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____________2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_____________3) == 0x000660, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_____________3' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000668, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue_2) == 0x000670, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_7) == 0x000678, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_IsValid_ReturnValue_8) == 0x000679, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_Conv_IntToString_ReturnValue) == 0x000680, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000690, "Member 'GA_HoldAttack_Miuwu_Vision_C_ExecuteUbergraph_GA_HoldAttack_Miuwu_Vision::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.EventReceived_18B59F5945020DB23C42FD889D871454
// 0x00B8 (0x00B8 - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454) == 0x000008, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454) == 0x0000B8, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454, Payload) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD889D871454::Payload' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.Added_21071CB943CD992BF8EFD6A32DDBCD6B
// 0x000C (0x000C - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B) == 0x000004, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B) == 0x00000C, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B, Tag) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A32DDBCD6B::Tag' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.Removed_DB9F64004F8908FEAD99D3819F12BA58
// 0x000C (0x000C - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58) == 0x000004, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58) == 0x00000C, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58, Tag) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_Removed_DB9F64004F8908FEAD99D3819F12BA58::Tag' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.Added_21071CB943CD992BF8EFD6A3BFF71E45
// 0x000C (0x000C - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45) == 0x000004, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45) == 0x00000C, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45, Tag) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A3BFF71E45::Tag' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.Added_21071CB943CD992BF8EFD6A323A19C1C
// 0x000C (0x000C - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C) == 0x000004, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C) == 0x00000C, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C, Tag) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_Added_21071CB943CD992BF8EFD6A323A19C1C::Tag' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.EventReceived_18B59F5945020DB23C42FD88F314C93F
// 0x00B8 (0x00B8 - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F) == 0x000008, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F) == 0x0000B8, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F, Payload) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_EventReceived_18B59F5945020DB23C42FD88F314C93F::Payload' has a wrong offset!");

// Function GA_HoldAttack_Miuwu_Vision.GA_HoldAttack_Miuwu_Vision_C.显示玩家模型
// 0x0008 (0x0008 - 0x0000)
struct GA_HoldAttack_Miuwu_Vision_C_显示玩家模型 final
{
public:
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HoldAttack_Miuwu_Vision_C_显示玩家模型) == 0x000004, "Wrong alignment on GA_HoldAttack_Miuwu_Vision_C_显示玩家模型");
static_assert(sizeof(GA_HoldAttack_Miuwu_Vision_C_显示玩家模型) == 0x000008, "Wrong size on GA_HoldAttack_Miuwu_Vision_C_显示玩家模型");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_显示玩家模型, CallFunc_GetIsInGame_ReturnValue) == 0x000000, "Member 'GA_HoldAttack_Miuwu_Vision_C_显示玩家模型::CallFunc_GetIsInGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HoldAttack_Miuwu_Vision_C_显示玩家模型, CallFunc_____ID___ID) == 0x000004, "Member 'GA_HoldAttack_Miuwu_Vision_C_显示玩家模型::CallFunc_____ID___ID' has a wrong offset!");

}

