#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Move_GYXK

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EHookInteractTypeBp_structs.hpp"


namespace SDK::Params
{

// Function GA_Move_GYXK.GA_Move_GYXK_C.ExecuteUbergraph_GA_Move_GYXK
// 0x01A8 (0x01A8 - 0x0000)
struct GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FixHookTargetActor_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc____________;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHookInteractTypeBp                           CallFunc_GetHookTargetType_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_1;      // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____________1;                            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SlashHookPointHasLookAtConfig_ReturnValue; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHookInteractTypeBp                           CallFunc_GetHookTargetType_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue; // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_D_Conv_VectorToString_ReturnValue;        // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue_1;  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SlashHookPointHasLookAtConfig_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_2;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_D_Conv_VectorToString_ReturnValue_1;      // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_Add_VectorVector_ReturnValue;           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____________2;                            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_2;      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK) == 0x000008, "Wrong alignment on GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK");
static_assert(sizeof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK) == 0x0001A8, "Wrong size on GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, EntryPoint) == 0x000000, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc__________) == 0x000008, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________1) == 0x000010, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_FixHookTargetActor_ReturnValue) == 0x000018, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_FixHookTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________2) == 0x000038, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc____________) == 0x000040, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________3) == 0x000048, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, K2Node_Event_bWasCancelled) == 0x000050, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________4) == 0x000070, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_GetHookTargetType_ReturnValue) == 0x000078, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_GetHookTargetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00007A, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00007B, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x00007C, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_Int64Int64_ReturnValue_1) == 0x00007D, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________5) == 0x000080, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_____________1) == 0x000088, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________6) == 0x000090, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________7) == 0x000098, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_SlashHookPointHasLookAtConfig_ReturnValue) == 0x0000A0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_SlashHookPointHasLookAtConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_GetHookTargetType_ReturnValue_1) == 0x0000A1, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_GetHookTargetType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000A2, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue) == 0x0000A8, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_Conv_VectorToString_ReturnValue) == 0x0000C0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x0000D0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_Conv_VectorToString_ReturnValue) == 0x0000E0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________8) == 0x0000F0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_Conv_VectorDoubleToVector_ReturnValue_1) == 0x0000F8, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_Conv_VectorDoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________9) == 0x000108, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc________ReturnValue) == 0x000110, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________10) == 0x000118, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc________ReturnValue_1) == 0x000120, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc________ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________11) == 0x000128, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_SlashHookPointHasLookAtConfig_ReturnValue_1) == 0x000130, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_SlashHookPointHasLookAtConfig_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________12) == 0x000138, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_K2_GetActorLocation_ReturnValue_2) == 0x000140, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_Conv_VectorToString_ReturnValue_1) == 0x000158, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_D_Add_VectorVector_ReturnValue) == 0x000168, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_D_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc________ReturnValue_2) == 0x000180, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc________ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________13) == 0x000188, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc________ReturnValue_3) == 0x000190, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc________ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc___________14) == 0x000198, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_____________2) == 0x0001A0, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_____________2' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK, CallFunc_EqualEqual_Int64Int64_ReturnValue_2) == 0x0001A1, "Member 'GA_Move_GYXK_C_ExecuteUbergraph_GA_Move_GYXK::CallFunc_EqualEqual_Int64Int64_ReturnValue_2' has a wrong offset!");

// Function GA_Move_GYXK.GA_Move_GYXK_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Move_GYXK_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Move_GYXK_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Move_GYXK_C_K2_OnEndAbility");
static_assert(sizeof(GA_Move_GYXK_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Move_GYXK_C_K2_OnEndAbility");
static_assert(offsetof(GA_Move_GYXK_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Move_GYXK_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Move_GYXK.GA_Move_GYXK_C.设置最终位置及朝向
// 0x0018 (0x0018 - 0x0000)
struct GA_Move_GYXK_C_设置最终位置及朝向 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_D_FindLookAtRotation_ReturnValue;         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Move_GYXK_C_设置最终位置及朝向) == 0x000008, "Wrong alignment on GA_Move_GYXK_C_设置最终位置及朝向");
static_assert(sizeof(GA_Move_GYXK_C_设置最终位置及朝向) == 0x000018, "Wrong size on GA_Move_GYXK_C_设置最终位置及朝向");
static_assert(offsetof(GA_Move_GYXK_C_设置最终位置及朝向, CallFunc__________) == 0x000000, "Member 'GA_Move_GYXK_C_设置最终位置及朝向::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置最终位置及朝向, CallFunc________ReturnValue) == 0x000008, "Member 'GA_Move_GYXK_C_设置最终位置及朝向::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置最终位置及朝向, CallFunc_D_FindLookAtRotation_ReturnValue) == 0x00000C, "Member 'GA_Move_GYXK_C_设置最终位置及朝向::CallFunc_D_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function GA_Move_GYXK.GA_Move_GYXK_C.设置当前交互点
// 0x0028 (0x0028 - 0x0000)
struct GA_Move_GYXK_C_设置当前交互点 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FixHookTargetActor_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> K2Node_DynamicCast_AsBPI_Creature_Interface;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Move_GYXK_C_设置当前交互点) == 0x000008, "Wrong alignment on GA_Move_GYXK_C_设置当前交互点");
static_assert(sizeof(GA_Move_GYXK_C_设置当前交互点) == 0x000028, "Wrong size on GA_Move_GYXK_C_设置当前交互点");
static_assert(offsetof(GA_Move_GYXK_C_设置当前交互点, CallFunc__________) == 0x000000, "Member 'GA_Move_GYXK_C_设置当前交互点::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置当前交互点, CallFunc_FixHookTargetActor_ReturnValue) == 0x000008, "Member 'GA_Move_GYXK_C_设置当前交互点::CallFunc_FixHookTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置当前交互点, K2Node_DynamicCast_AsBPI_Creature_Interface) == 0x000010, "Member 'GA_Move_GYXK_C_设置当前交互点::K2Node_DynamicCast_AsBPI_Creature_Interface' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置当前交互点, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Move_GYXK_C_设置当前交互点::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置当前交互点, CallFunc_GetEntityId_ReturnValue) == 0x000024, "Member 'GA_Move_GYXK_C_设置当前交互点::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_Move_GYXK.GA_Move_GYXK_C.设置安全点位置及朝向
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Move_GYXK_C_设置安全点位置及朝向 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SlashHookPointSafePointRot_ReturnValue;   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue_1;  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_SlashHookPointSafePointLoc_ReturnValue;   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Move_GYXK_C_设置安全点位置及朝向) == 0x000008, "Wrong alignment on GA_Move_GYXK_C_设置安全点位置及朝向");
static_assert(sizeof(GA_Move_GYXK_C_设置安全点位置及朝向) == 0x0000C0, "Wrong size on GA_Move_GYXK_C_设置安全点位置及朝向");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc__________) == 0x000000, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc___________1) == 0x000008, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_SlashHookPointSafePointRot_ReturnValue) == 0x000028, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_SlashHookPointSafePointRot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Roll_1) == 0x000040, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Pitch_1) == 0x000044, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_BreakRotator_Yaw_1) == 0x000048, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_Conv_VectorToVectorDouble_ReturnValue) == 0x000050, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_Conv_VectorToVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_Conv_VectorToVectorDouble_ReturnValue_1) == 0x000078, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_Conv_VectorToVectorDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_SlashHookPointSafePointLoc_ReturnValue) == 0x000090, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_SlashHookPointSafePointLoc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_设置安全点位置及朝向, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'GA_Move_GYXK_C_设置安全点位置及朝向::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GA_Move_GYXK.GA_Move_GYXK_C.瞬移特效
// 0x0070 (0x0070 - 0x0000)
struct GA_Move_GYXK_C_瞬移特效 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_________ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Move_GYXK_C_瞬移特效) == 0x000010, "Wrong alignment on GA_Move_GYXK_C_瞬移特效");
static_assert(sizeof(GA_Move_GYXK_C_瞬移特效) == 0x000070, "Wrong size on GA_Move_GYXK_C_瞬移特效");
static_assert(offsetof(GA_Move_GYXK_C_瞬移特效, CallFunc__________) == 0x000000, "Member 'GA_Move_GYXK_C_瞬移特效::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_瞬移特效, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_Move_GYXK_C_瞬移特效::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Move_GYXK_C_瞬移特效, CallFunc_MakeTransformDouble_ReturnValue) == 0x000020, "Member 'GA_Move_GYXK_C_瞬移特效::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
