#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_QTE_Right

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EHookInteractTypeBp_structs.hpp"


namespace SDK::Params
{

// Function GA_QTE_Right.GA_QTE_Right_C.ExecuteUbergraph_GA_QTE_Right
// 0x0500 (0x0500 - 0x0000)
struct GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc__________;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________2;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc______________;                            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0180(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B8(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FixHookTargetActor_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SlashHookPointHasLookAtConfig_ReturnValue; // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHookInteractTypeBp                           CallFunc_GetHookTargetType_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue; // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_2;      // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0290(0x0028)(ZeroConstructor)
	struct FVectorDouble                          CallFunc_D_Add_VectorVector_ReturnValue;           // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue_1;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________12;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0320(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector__;                             // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___1;                           // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X;                      // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y;                      // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z;                      // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue;    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___2;                           // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___3;                           // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_1;                    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_1;                    // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_1;                    // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue_1;  // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue_1;         // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc____________;                              // 0x0480(0x0040)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc________;                                  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x04D8(0x0028)(ZeroConstructor)
};
static_assert(alignof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right) == 0x000010, "Wrong alignment on GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right");
static_assert(sizeof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right) == 0x000500, "Wrong size on GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, EntryPoint) == 0x000000, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc__________) == 0x000058, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________1) == 0x000090, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____GA______________) == 0x0000A0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________2) == 0x0000E8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetDisplayName_ReturnValue) == 0x000118, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetObjectClass_ReturnValue) == 0x000128, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000130, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000134, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000138, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________3) == 0x000140, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_DynamicCast_AsTs_Base_Character) == 0x000148, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc______________) == 0x000151, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________4) == 0x000158, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________5) == 0x000160, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_______________1) == 0x000168, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc__________SpeedRatio) == 0x00016C, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000170, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_IsValid_ReturnValue_2) == 0x000178, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_5) == 0x000180, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____GA_______________1) == 0x0001A8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_Event_bWasCancelled) == 0x0001E0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________6) == 0x0001E8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x0001F0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________7) == 0x000208, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_FixHookTargetActor_ReturnValue) == 0x000210, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_FixHookTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________8) == 0x000218, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000220, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_SlashHookPointHasLookAtConfig_ReturnValue) == 0x000238, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_SlashHookPointHasLookAtConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________9) == 0x000240, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetHookTargetType_ReturnValue) == 0x000248, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetHookTargetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue) == 0x000250, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_SlashHookPointCharacterLookAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000268, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________10) == 0x000270, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_K2_GetActorLocation_ReturnValue_2) == 0x000278, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_7) == 0x000290, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_Add_VectorVector_ReturnValue) == 0x0002B8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc________ReturnValue) == 0x0002D0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________11) == 0x0002D8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc________ReturnValue_1) == 0x0002E0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc________ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________12) == 0x0002E8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0002F0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetDisplayName_ReturnValue_1) == 0x0002F8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetObjectClass_ReturnValue_1) == 0x000308, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000310, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000318, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_8) == 0x000320, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000348, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_DynamicCast_bSuccess_1) == 0x000350, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________13) == 0x000358, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_______________2) == 0x000360, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________14) == 0x000368, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________15) == 0x000370, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_______________3) == 0x000378, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc__________SpeedRatio_1) == 0x00037C, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000380, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_IsValid_ReturnValue_3) == 0x000388, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________16) == 0x000390, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____Vector__) == 0x000398, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____Vector__' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____Vector___1) == 0x0003B0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____Vector___1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_X) == 0x0003C8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_X' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_Y) == 0x0003D0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_Y' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_Z) == 0x0003D8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_Z' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_EqualEqual_VectorVector_ReturnValue) == 0x0003E0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x0003E4, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_MakeRotator_ReturnValue) == 0x0003E8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________17) == 0x0003F8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____Vector___2) == 0x000400, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____Vector___2' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_____Vector___3) == 0x000418, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_____Vector___3' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_X_1) == 0x000430, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_X_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_Y_1) == 0x000438, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_Y_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_BreakVectorDouble_Z_1) == 0x000440, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_BreakVectorDouble_Z_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_D_EqualEqual_VectorVector_ReturnValue_1) == 0x000448, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_D_EqualEqual_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_DoubleToFloat_ReturnValue_1) == 0x00044C, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_DoubleToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_MakeRotator_ReturnValue_1) == 0x000450, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________18) == 0x000460, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________19) == 0x000468, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc___________20) == 0x000470, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc____________) == 0x000480, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0004C0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, CallFunc________) == 0x0004D0, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::CallFunc________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right, K2Node_CreateDelegate_OutputDelegate_9) == 0x0004D8, "Member 'GA_QTE_Right_C_ExecuteUbergraph_GA_QTE_Right::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_QTE_Right_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_QTE_Right_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_QTE_Right_C_K2_OnEndAbility");
static_assert(sizeof(GA_QTE_Right_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_QTE_Right_C_K2_OnEndAbility");
static_assert(offsetof(GA_QTE_Right_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_QTE_Right_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.设置最终位置及朝向
// 0x0018 (0x0018 - 0x0000)
struct GA_QTE_Right_C_设置最终位置及朝向 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc________ReturnValue;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_D_FindLookAtRotation_ReturnValue;         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_QTE_Right_C_设置最终位置及朝向) == 0x000008, "Wrong alignment on GA_QTE_Right_C_设置最终位置及朝向");
static_assert(sizeof(GA_QTE_Right_C_设置最终位置及朝向) == 0x000018, "Wrong size on GA_QTE_Right_C_设置最终位置及朝向");
static_assert(offsetof(GA_QTE_Right_C_设置最终位置及朝向, CallFunc__________) == 0x000000, "Member 'GA_QTE_Right_C_设置最终位置及朝向::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置最终位置及朝向, CallFunc________ReturnValue) == 0x000008, "Member 'GA_QTE_Right_C_设置最终位置及朝向::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置最终位置及朝向, CallFunc_D_FindLookAtRotation_ReturnValue) == 0x00000C, "Member 'GA_QTE_Right_C_设置最终位置及朝向::CallFunc_D_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.设置当前交互点
// 0x0028 (0x0028 - 0x0000)
struct GA_QTE_Right_C_设置当前交互点 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FixHookTargetActor_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> K2Node_DynamicCast_AsBPI_Creature_Interface;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_QTE_Right_C_设置当前交互点) == 0x000008, "Wrong alignment on GA_QTE_Right_C_设置当前交互点");
static_assert(sizeof(GA_QTE_Right_C_设置当前交互点) == 0x000028, "Wrong size on GA_QTE_Right_C_设置当前交互点");
static_assert(offsetof(GA_QTE_Right_C_设置当前交互点, CallFunc__________) == 0x000000, "Member 'GA_QTE_Right_C_设置当前交互点::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置当前交互点, CallFunc_FixHookTargetActor_ReturnValue) == 0x000008, "Member 'GA_QTE_Right_C_设置当前交互点::CallFunc_FixHookTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置当前交互点, K2Node_DynamicCast_AsBPI_Creature_Interface) == 0x000010, "Member 'GA_QTE_Right_C_设置当前交互点::K2Node_DynamicCast_AsBPI_Creature_Interface' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置当前交互点, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_QTE_Right_C_设置当前交互点::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置当前交互点, CallFunc_GetEntityId_ReturnValue) == 0x000024, "Member 'GA_QTE_Right_C_设置当前交互点::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.设置安全点位置及朝向
// 0x00C0 (0x00C0 - 0x0000)
struct GA_QTE_Right_C_设置安全点位置及朝向 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SlashHookPointSafePointRot_ReturnValue;   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue_1;  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_SlashHookPointSafePointLoc_ReturnValue;   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_QTE_Right_C_设置安全点位置及朝向) == 0x000008, "Wrong alignment on GA_QTE_Right_C_设置安全点位置及朝向");
static_assert(sizeof(GA_QTE_Right_C_设置安全点位置及朝向) == 0x0000C0, "Wrong size on GA_QTE_Right_C_设置安全点位置及朝向");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc__________) == 0x000000, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc___________1) == 0x000008, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_SlashHookPointSafePointRot_ReturnValue) == 0x000028, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_SlashHookPointSafePointRot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Roll_1) == 0x000040, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Pitch_1) == 0x000044, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_BreakRotator_Yaw_1) == 0x000048, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_Conv_VectorToVectorDouble_ReturnValue) == 0x000050, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_Conv_VectorToVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_Conv_VectorToVectorDouble_ReturnValue_1) == 0x000078, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_Conv_VectorToVectorDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_SlashHookPointSafePointLoc_ReturnValue) == 0x000090, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_SlashHookPointSafePointLoc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_设置安全点位置及朝向, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'GA_QTE_Right_C_设置安全点位置及朝向::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.瞬移特效
// 0x0070 (0x0070 - 0x0000)
struct GA_QTE_Right_C_瞬移特效 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_________ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_QTE_Right_C_瞬移特效) == 0x000010, "Wrong alignment on GA_QTE_Right_C_瞬移特效");
static_assert(sizeof(GA_QTE_Right_C_瞬移特效) == 0x000070, "Wrong size on GA_QTE_Right_C_瞬移特效");
static_assert(offsetof(GA_QTE_Right_C_瞬移特效, CallFunc__________) == 0x000000, "Member 'GA_QTE_Right_C_瞬移特效::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_瞬移特效, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_QTE_Right_C_瞬移特效::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_瞬移特效, CallFunc_MakeTransformDouble_ReturnValue) == 0x000020, "Member 'GA_QTE_Right_C_瞬移特效::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_瞬移特效, CallFunc_________ReturnValue) == 0x000060, "Member 'GA_QTE_Right_C_瞬移特效::CallFunc_________ReturnValue' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.获取镜头变换
// 0x0090 (0x0090 - 0x0000)
struct GA_QTE_Right_C_获取镜头变换 final
{
public:
	struct FTransformDouble                       镜头变换;                                          // 0x0000(0x0040)(Parm, OutParm, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x0050(0x0040)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_QTE_Right_C_获取镜头变换) == 0x000010, "Wrong alignment on GA_QTE_Right_C_获取镜头变换");
static_assert(sizeof(GA_QTE_Right_C_获取镜头变换) == 0x000090, "Wrong size on GA_QTE_Right_C_获取镜头变换");
static_assert(offsetof(GA_QTE_Right_C_获取镜头变换, 镜头变换) == 0x000000, "Member 'GA_QTE_Right_C_获取镜头变换::镜头变换' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_获取镜头变换, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000040, "Member 'GA_QTE_Right_C_获取镜头变换::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_QTE_Right_C_获取镜头变换, CallFunc_D_GetTransform_ReturnValue) == 0x000050, "Member 'GA_QTE_Right_C_获取镜头变换::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");

// Function GA_QTE_Right.GA_QTE_Right_C.依据斩击方向选择匹配切屏特效
// 0x0078 (0x0078 - 0x0000)
struct GA_QTE_Right_C_依据斩击方向选择匹配切屏特效 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
