#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Skill02_Jinxi

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Skill02_Jinxi.GA_Skill02_Jinxi_C.ExecuteUbergraph_GA_Skill02_Jinxi
// 0x07B0 (0x07B0 - 0x0000)
struct GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x00D8(0x00B8)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________1;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01A0(0x00B8)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0278(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x02A0(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________2;                              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0380(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0490(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________7;                              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA_______________1;                   // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0508(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0540(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________8;                              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0578(0x0020)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x05A0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x05E0(0x0028)(ZeroConstructor)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0608(0x0020)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0630(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________10;                             // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc___Current_______;                         // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________4;                          // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc___ID____Buff_____;                        // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________23;                             // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio_1;                    // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________24;                             // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________25;                             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________26;                             // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________27;                             // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc___ID____Buff______1;                      // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________28;                             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________29;                             // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0778(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________30;                             // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________31;                             // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________32;                             // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc___ID____Buff______2;                      // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi) == 0x000008, "Wrong alignment on GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi");
static_assert(sizeof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi) == 0x0007B0, "Wrong size on GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, EntryPoint) == 0x000000, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc__________) == 0x000008, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, ___struct_Variable) == 0x0000D8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_Greater_IntInt_ReturnValue) == 0x000190, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000194, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________1) == 0x000198, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CustomEvent_Payload) == 0x0001A0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetDisplayName_ReturnValue) == 0x000258, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetObjectClass_ReturnValue) == 0x000268, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000270, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_5) == 0x000278, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, ___struct_Variable_1) == 0x0002A0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_____GA______________) == 0x000358, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_Conv_NameToString_ReturnValue) == 0x000368, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________2) == 0x000378, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CustomEvent_Payload_1) == 0x000380, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue) == 0x000438, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________3) == 0x000440, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc______________) == 0x000448, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc__________SpeedRatio) == 0x00044C, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________4) == 0x000450, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_______________1) == 0x000458, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________5) == 0x000460, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________6) == 0x000468, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_______________2) == 0x000470, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000478, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_DynamicCast_AsTs_Base_Character) == 0x000480, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_DynamicCast_bSuccess) == 0x000488, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_6) == 0x000490, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0004B8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________7) == 0x0004C0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0004C8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetDisplayName_ReturnValue_1) == 0x0004D0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_1) == 0x0004E0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetObjectClass_ReturnValue_1) == 0x0004E8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x0004F0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_____GA_______________1) == 0x0004F8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_7) == 0x000508, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000530, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_8) == 0x000540, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________8) == 0x000568, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_2) == 0x000570, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000578, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000598, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_9) == 0x0005A0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0005C8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_DynamicCast_bSuccess_1) == 0x0005D0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________9) == 0x0005D8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005E0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000608, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_Event_bWasCancelled) == 0x000628, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_And_IntInt_ReturnValue) == 0x00062C, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, K2Node_CreateDelegate_OutputDelegate_11) == 0x000630, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________10) == 0x000658, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_3) == 0x000660, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________11) == 0x000668, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_______________3) == 0x000670, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________12) == 0x000678, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________13) == 0x000680, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________14) == 0x000688, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___Current_______) == 0x000690, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___Current_______' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000694, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________15) == 0x000698, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________16) == 0x0006A0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________17) == 0x0006A8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_______________4) == 0x0006B0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_______________4' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________18) == 0x0006B8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___ID____Buff_____) == 0x0006C0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___ID____Buff_____' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0006C8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0006D8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________19) == 0x0006E0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________20) == 0x0006E8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________21) == 0x0006F0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________21' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________22) == 0x0006F8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________22' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________23) == 0x000700, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________23' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc__________SpeedRatio_1) == 0x000708, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000710, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_4) == 0x000718, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________24) == 0x000720, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________24' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000728, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________25) == 0x000730, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________25' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_5) == 0x000738, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________26) == 0x000740, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________26' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000748, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________27) == 0x000750, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________27' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_IsValid_ReturnValue_6) == 0x000758, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___ID____Buff______1) == 0x00075C, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___ID____Buff______1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000760, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________28) == 0x000768, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________28' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________29) == 0x000770, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________29' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000778, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000788, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________30) == 0x000790, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________30' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________31) == 0x000798, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________31' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___________32) == 0x0007A0, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___________32' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc___ID____Buff______2) == 0x0007A8, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc___ID____Buff______2' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0007AC, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi, CallFunc_BooleanOR_ReturnValue) == 0x0007AD, "Member 'GA_Skill02_Jinxi_C_ExecuteUbergraph_GA_Skill02_Jinxi::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Skill02_Jinxi.GA_Skill02_Jinxi_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Skill02_Jinxi_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Skill02_Jinxi_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Skill02_Jinxi_C_K2_OnEndAbility");
static_assert(sizeof(GA_Skill02_Jinxi_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Skill02_Jinxi_C_K2_OnEndAbility");
static_assert(offsetof(GA_Skill02_Jinxi_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Skill02_Jinxi_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Skill02_Jinxi.GA_Skill02_Jinxi_C.EventReceived_18B59F5945020DB23C42FD8838024515
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515) == 0x000008, "Wrong alignment on GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515");
static_assert(sizeof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515) == 0x0000B8, "Wrong size on GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515");
static_assert(offsetof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515, Payload) == 0x000000, "Member 'GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8838024515::Payload' has a wrong offset!");

// Function GA_Skill02_Jinxi.GA_Skill02_Jinxi_C.EventReceived_18B59F5945020DB23C42FD8864D9312B
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B) == 0x000008, "Wrong alignment on GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B");
static_assert(sizeof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B) == 0x0000B8, "Wrong size on GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B");
static_assert(offsetof(GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B, Payload) == 0x000000, "Member 'GA_Skill02_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8864D9312B::Payload' has a wrong offset!");

}

