#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Skill01_Jinxi

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Skill01_Jinxi.GA_Skill01_Jinxi_C.ExecuteUbergraph_GA_Skill01_Jinxi
// 0x0758 (0x0758 - 0x0000)
struct GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0090(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x00F0(0x00B8)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01C8(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0290(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________2;                              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x02D0(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0390(0x0020)()
	float                                         CallFunc__________SpeedRatio;                      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03B8(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0420(0x00B8)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_7; // 0x04E0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________6;                              // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_____GA_______________1;                   // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0550(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________7;                              // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0598(0x0028)(ZeroConstructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x05D8(0x0028)(ZeroConstructor)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0600(0x0020)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0630(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________9;                              // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________10;                             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_682[0x6];                                      // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x06A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B2[0x6];                                      // 0x06B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x06D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc___ID____Buff_____;                        // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio_1;                    // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi) == 0x000008, "Wrong alignment on GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi");
static_assert(sizeof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi) == 0x000758, "Wrong size on GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, EntryPoint) == 0x000000, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc__________) == 0x000008, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_ContainsTag_ReturnValue) == 0x000038, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_3) == 0x000090, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000E0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________1) == 0x0000E8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, ___struct_Variable) == 0x0000F0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetDisplayName_ReturnValue) == 0x0001A8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetObjectClass_ReturnValue) == 0x0001B8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0001C0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CustomEvent_Payload) == 0x0001C8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_____GA______________) == 0x000280, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_5) == 0x000290, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_Conv_NameToString_ReturnValue) == 0x0002B8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________2) == 0x0002C8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, ___struct_Variable_1) == 0x0002D0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue) == 0x000388, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000390, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc__________SpeedRatio) == 0x0003B0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003B8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________3) == 0x0003E0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc______________) == 0x0003E8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________4) == 0x0003F0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________5) == 0x0003F8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_______________1) == 0x000400, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000408, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_DynamicCast_AsTs_Base_Character) == 0x000410, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_DynamicCast_bSuccess) == 0x000418, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CustomEvent_Payload_1) == 0x000420, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0004D8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_7) == 0x0004E0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________6) == 0x000508, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000510, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_____GA_______________1) == 0x000518, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_1) == 0x000528, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetDisplayName_ReturnValue_1) == 0x000530, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetObjectClass_ReturnValue_1) == 0x000540, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000548, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_8) == 0x000550, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000578, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________7) == 0x000588, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_2) == 0x000590, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_9) == 0x000598, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0005C0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0005C8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_DynamicCast_bSuccess_1) == 0x0005D0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005D8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000600, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________8) == 0x000620, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_______________2) == 0x000628, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_CreateDelegate_OutputDelegate_11) == 0x000630, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, K2Node_Event_bWasCancelled) == 0x000658, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________9) == 0x000660, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_3) == 0x000668, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________10) == 0x000670, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________11) == 0x000678, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_4) == 0x000680, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_BooleanAND_ReturnValue) == 0x000681, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________12) == 0x000688, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________13) == 0x000690, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000698, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0006A0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0006B0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_5) == 0x0006B1, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________14) == 0x0006B8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_______________3) == 0x0006C0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________15) == 0x0006C8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x0006D0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0006E0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________16) == 0x0006E8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___ID____Buff_____) == 0x0006F0, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___ID____Buff_____' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc__________SpeedRatio_1) == 0x0006F4, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0006F8, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000700, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_6) == 0x000708, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________17) == 0x000710, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________18) == 0x000718, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000720, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_IsValid_ReturnValue_7) == 0x000728, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________19) == 0x000730, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________20) == 0x000738, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________21) == 0x000740, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________21' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc___________22) == 0x000748, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc___________22' has a wrong offset!");
static_assert(offsetof(GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi, CallFunc_ContainsTag_ReturnValue_1) == 0x000750, "Member 'GA_Skill01_Jinxi_C_ExecuteUbergraph_GA_Skill01_Jinxi::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");

// Function GA_Skill01_Jinxi.GA_Skill01_Jinxi_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Skill01_Jinxi_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Skill01_Jinxi_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Skill01_Jinxi_C_K2_OnEndAbility");
static_assert(sizeof(GA_Skill01_Jinxi_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Skill01_Jinxi_C_K2_OnEndAbility");
static_assert(offsetof(GA_Skill01_Jinxi_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Skill01_Jinxi_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Skill01_Jinxi.GA_Skill01_Jinxi_C.EventReceived_18B59F5945020DB23C42FD8825B6A318
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318) == 0x000008, "Wrong alignment on GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318");
static_assert(sizeof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318) == 0x0000B8, "Wrong size on GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318");
static_assert(offsetof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318, Payload) == 0x000000, "Member 'GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD8825B6A318::Payload' has a wrong offset!");

// Function GA_Skill01_Jinxi.GA_Skill01_Jinxi_C.EventReceived_18B59F5945020DB23C42FD88C4B006DD
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD) == 0x000008, "Wrong alignment on GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD");
static_assert(sizeof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD) == 0x0000B8, "Wrong size on GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD");
static_assert(offsetof(GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD, Payload) == 0x000000, "Member 'GA_Skill01_Jinxi_C_EventReceived_18B59F5945020DB23C42FD88C4B006DD::Payload' has a wrong offset!");

}

