#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_XuliSkill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_XuliSkill.GA_XuliSkill_C.ExecuteUbergraph_GA_XuliSkill
// 0x0DC0 (0x0DC0 - 0x0000)
struct GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D0(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00F8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0120(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0148(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0170(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0228(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0250(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0318(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio;                      // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0388(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________3;                              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x6];                                      // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x03F8(0x00B8)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x04B0(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_12; // 0x0578(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________4;                              // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA_______________1;                   // 0x05C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x05D0(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio_1;                    // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0640(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________8;                              // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x06A0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________2;                   // 0x06C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x06D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x06E8(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________9;                              // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0720(0x0028)(ZeroConstructor)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x0750(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x080A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80B[0x5];                                      // 0x080B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_3;                      // 0x0810(0x00B8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x08C8(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio_2;                    // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________4;                          // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_901[0x7];                                      // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________5;                          // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_2;          // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_931[0x7];                                      // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_3;          // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_3;                              // 0x0948(0x00B8)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A04[0x4];                                      // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________13;                             // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0A10(0x00B8)()
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0AD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD1[0x7];                                      // 0x0AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0AD8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x7];                                      // 0x0AF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_19; // 0x0AF8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0B20(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_____GA_______________3;                   // 0x0B30(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________14;                             // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________15;                             // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0B58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_3;             // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x0B70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0B71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B72[0x2];                                      // 0x0B72(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0B74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0B78(0x0028)(ZeroConstructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_3; // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_3;          // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB1[0x7];                                      // 0x0BB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x0BB8(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________6;                          // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE9[0x7];                                      // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0BF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x0C18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________23;                             // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____EntityId__;                           // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_C2C[0x4];                                      // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________24;                             // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________25;                             // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________26;                             // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_______________7;                          // 0x0C49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4A[0x2];                                      // 0x0C4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_3;                    // 0x0C4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0C50(0x0028)(ZeroConstructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3; // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________27;                             // 0x0C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector__;                             // 0x0C90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___1;                           // 0x0CA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X;                      // 0x0CC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y;                      // 0x0CC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z;                      // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue;    // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD9[0x3];                                      // 0x0CD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x0CDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0CE0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CEC[0x4];                                      // 0x0CEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________28;                             // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___2;                           // 0x0CF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_____Vector___3;                           // 0x0D10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_1;                    // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_1;                    // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_1;                    // 0x0D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_EqualEqual_VectorVector_ReturnValue_1;  // 0x0D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D41[0x3];                                      // 0x0D41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue_1;         // 0x0D44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0D48(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D54[0x4];                                      // 0x0D54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________29;                             // 0x0D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________30;                             // 0x0D60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0D68(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________31;                             // 0x0D78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_23; // 0x0D80(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________32;                             // 0x0DA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________33;                             // 0x0DB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc________;                                  // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0DBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill) == 0x000008, "Wrong alignment on GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill");
static_assert(sizeof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill) == 0x000DC0, "Wrong size on GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, EntryPoint) == 0x000000, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000D0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000F8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_7) == 0x000120, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_8) == 0x000148, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CustomEvent_Payload) == 0x000170, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_9) == 0x000228, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___struct_Variable) == 0x000250, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000308, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue) == 0x000310, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_10) == 0x000318, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc__________SpeedRatio) == 0x000340, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc__________) == 0x000348, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc______________) == 0x000350, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________1) == 0x000358, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________2) == 0x000360, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________1) == 0x000368, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000370, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_AsTs_Base_Character) == 0x000378, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_bSuccess) == 0x000380, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_11) == 0x000388, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0003B0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________3) == 0x0003B8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0003C0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0003C8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_1) == 0x0003D0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_2) == 0x0003D1, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetDisplayName_ReturnValue) == 0x0003D8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetObjectClass_ReturnValue) == 0x0003E8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0003F0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___struct_Variable_1) == 0x0003F8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CustomEvent_Payload_1) == 0x0004B0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_____GA______________) == 0x000568, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_12) == 0x000578, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_NameToString_ReturnValue) == 0x0005A0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________4) == 0x0005B0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_3) == 0x0005B8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_____GA_______________1) == 0x0005C0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_13) == 0x0005D0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc__________SpeedRatio_1) == 0x0005F8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________5) == 0x000600, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________2) == 0x000608, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________6) == 0x000610, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________7) == 0x000618, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________3) == 0x000620, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000628, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000630, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_bSuccess_1) == 0x000638, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00063C, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_14) == 0x000640, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________8) == 0x000668, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000670, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetDisplayName_ReturnValue_1) == 0x000678, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_4) == 0x000688, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetObjectClass_ReturnValue_1) == 0x000690, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000698, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_15) == 0x0006A0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_____GA_______________2) == 0x0006C8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_____GA_______________2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0006D8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_16) == 0x0006E8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________9) == 0x000710, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_5) == 0x000718, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_17) == 0x000720, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000748, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___struct_Variable_2) == 0x000750, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_6) == 0x000808, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___bool_IsClosed_Variable) == 0x000809, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___bool_Has_Been_Initd_Variable) == 0x00080A, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CustomEvent_Payload_3) == 0x000810, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CustomEvent_Payload_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_18) == 0x0008C8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc__________SpeedRatio_2) == 0x0008F0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc__________SpeedRatio_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________10) == 0x0008F8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________4) == 0x000900, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________4' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________11) == 0x000908, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________12) == 0x000910, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________5) == 0x000918, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________5' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x000920, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_AsTs_Base_Character_2) == 0x000928, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_AsTs_Base_Character_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_bSuccess_2) == 0x000930, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_WaitGameplayEvent_ReturnValue_3) == 0x000938, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_WaitGameplayEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_7) == 0x000940, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, ___struct_Variable_3) == 0x000948, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000A00, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________13) == 0x000A08, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CustomEvent_Payload_2) == 0x000A10, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x000AC8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_8) == 0x000AD0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetDisplayName_ReturnValue_2) == 0x000AD8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetObjectClass_ReturnValue_2) == 0x000AE8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000AF0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_19) == 0x000AF8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_NameToString_ReturnValue_2) == 0x000B20, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_____GA_______________3) == 0x000B30, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_____GA_______________3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________14) == 0x000B40, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_IsValid_ReturnValue_9) == 0x000B48, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________15) == 0x000B50, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetDisplayName_ReturnValue_3) == 0x000B58, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetObjectClass_ReturnValue_3) == 0x000B68, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetObjectClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x000B70, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_Event_bWasCancelled) == 0x000B71, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000B74, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_20) == 0x000B78, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_GetOwningActorFromActorInfo_ReturnValue_3) == 0x000BA0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_GetOwningActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_AsTs_Base_Character_3) == 0x000BA8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_AsTs_Base_Character_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_DynamicCast_bSuccess_3) == 0x000BB0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, K2Node_CreateDelegate_OutputDelegate_21) == 0x000BB8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________16) == 0x000BE0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc_______________6) == 0x000BE8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc_______________6' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________17) == 0x000BF0, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________18) == 0x000BF8, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________19) == 0x000C00, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill, CallFunc___________20) == 0x000C08, "Member 'GA_XuliSkill_C_ExecuteUbergraph_GA_XuliSkill::CallFunc___________20' has a wrong offset!");
