#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_XuliSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_XuliSkill.GA_XuliSkill_C
// 0x0018 (0x0580 - 0x0568)
class UGA_XuliSkill_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_XuliSkill_C;                     // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          已到阈值;                                          // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          已松开;                                            // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x2];                                      // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         当前交互点Id;                                      // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          自然退出;                                          // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_XuliSkill(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_18B59F5945020DB23C42FD8885708651(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E81DE028464();
	void OnBlendOut_5D118C384AE61F1C80292E81DE028464();
	void OnInterrupted_5D118C384AE61F1C80292E81DE028464();
	void OnCancelled_5D118C384AE61F1C80292E81DE028464();
	void OnTick_5D118C384AE61F1C80292E81DE028464();
	void OnCompleted_5D118C384AE61F1C80292E81EC1C24FC();
	void OnBlendOut_5D118C384AE61F1C80292E81EC1C24FC();
	void OnInterrupted_5D118C384AE61F1C80292E81EC1C24FC();
	void OnCancelled_5D118C384AE61F1C80292E81EC1C24FC();
	void OnTick_5D118C384AE61F1C80292E81EC1C24FC();
	void EventReceived_18B59F5945020DB23C42FD8893A3BE47(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E81F11AA4B6();
	void OnBlendOut_5D118C384AE61F1C80292E81F11AA4B6();
	void OnInterrupted_5D118C384AE61F1C80292E81F11AA4B6();
	void OnCancelled_5D118C384AE61F1C80292E81F11AA4B6();
	void OnTick_5D118C384AE61F1C80292E81F11AA4B6();
	void EventReceived_18B59F5945020DB23C42FD888D7FC5D9(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E8137062252();
	void OnBlendOut_5D118C384AE61F1C80292E8137062252();
	void OnInterrupted_5D118C384AE61F1C80292E8137062252();
	void OnCancelled_5D118C384AE61F1C80292E8137062252();
	void OnTick_5D118C384AE61F1C80292E8137062252();
	void EventReceived_18B59F5945020DB23C42FD887D0ABF99(const struct FGameplayEventData& Payload);
	void 瞬移特效();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_XuliSkill_C">();
	}
	static class UGA_XuliSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_XuliSkill_C>();
	}
};
static_assert(alignof(UGA_XuliSkill_C) == 0x000008, "Wrong alignment on UGA_XuliSkill_C");
static_assert(sizeof(UGA_XuliSkill_C) == 0x000580, "Wrong size on UGA_XuliSkill_C");
static_assert(offsetof(UGA_XuliSkill_C, UberGraphFrame_GA_XuliSkill_C) == 0x000568, "Member 'UGA_XuliSkill_C::UberGraphFrame_GA_XuliSkill_C' has a wrong offset!");
static_assert(offsetof(UGA_XuliSkill_C, 已到阈值) == 0x000570, "Member 'UGA_XuliSkill_C::已到阈值' has a wrong offset!");
static_assert(offsetof(UGA_XuliSkill_C, 已松开) == 0x000571, "Member 'UGA_XuliSkill_C::已松开' has a wrong offset!");
static_assert(offsetof(UGA_XuliSkill_C, 当前交互点Id) == 0x000574, "Member 'UGA_XuliSkill_C::当前交互点Id' has a wrong offset!");
static_assert(offsetof(UGA_XuliSkill_C, 自然退出) == 0x000578, "Member 'UGA_XuliSkill_C::自然退出' has a wrong offset!");

}

