#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUNPCData

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GPUNPCData.GPUNPCData_C
// 0x0018 (0x0050 - 0x0038)
class UGPUNPCData_C final : public UBakedBoneInstanceDataAsset
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPD_NpcSetupData_C*                     NpcSetupData;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBakedBoneTexture2D*                    Combined_Texture;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void 随机起始动画时间噪声贴图(class UTexture2D** OutNoiseTex, int32* OutNoiseIndex);
	void 生成MainMesh和SubMeshes(class USkeletalMesh** OutMainMesh, TArray<class USkeletalMesh*>* OutSubMeshes);
	void HasSetSkeletalMesh(bool* HasSet);
	void GetMeshesFromNPCSetupData(class USkeletalMesh** OutMainMesh, TArray<class USkeletalMesh*>* OutSubMeshes);
	void GetMaxNumTracks(int32* OutMaxNumTracks);
	void GetTotalNumFrames(int32* OutTotalNumFrames);
	void HasCombinedBakedBoneTexture(bool* Result);
	void 清空非合批资源();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GPUNPCData_C">();
	}
	static class UGPUNPCData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUNPCData_C>();
	}
};
static_assert(alignof(UGPUNPCData_C) == 0x000008, "Wrong alignment on UGPUNPCData_C");
static_assert(sizeof(UGPUNPCData_C) == 0x000050, "Wrong size on UGPUNPCData_C");
static_assert(offsetof(UGPUNPCData_C, SkeletalMesh) == 0x000038, "Member 'UGPUNPCData_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGPUNPCData_C, NpcSetupData) == 0x000040, "Member 'UGPUNPCData_C::NpcSetupData' has a wrong offset!");
static_assert(offsetof(UGPUNPCData_C, Combined_Texture) == 0x000048, "Member 'UGPUNPCData_C::Combined_Texture' has a wrong offset!");

}

