#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUNPCInstanceItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct GPUNPCInstanceItem.GPUNPCInstanceItem
// 0x0040 (0x0040 - 0x0000)
struct FGPUNPCInstanceItem final
{
public:
	int32                                         GroupIndex_30_3EB24D044076B13B256281A2DF62C60C;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimTextureIndex_34_464ED78F4D8939451CCB7BB2AA0EDF28; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InstanceTransform_31_528928834ADA639083CC9786B1908600; // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FGPUNPCInstanceItem) == 0x000010, "Wrong alignment on FGPUNPCInstanceItem");
static_assert(sizeof(FGPUNPCInstanceItem) == 0x000040, "Wrong size on FGPUNPCInstanceItem");
static_assert(offsetof(FGPUNPCInstanceItem, GroupIndex_30_3EB24D044076B13B256281A2DF62C60C) == 0x000000, "Member 'FGPUNPCInstanceItem::GroupIndex_30_3EB24D044076B13B256281A2DF62C60C' has a wrong offset!");
static_assert(offsetof(FGPUNPCInstanceItem, AnimTextureIndex_34_464ED78F4D8939451CCB7BB2AA0EDF28) == 0x000004, "Member 'FGPUNPCInstanceItem::AnimTextureIndex_34_464ED78F4D8939451CCB7BB2AA0EDF28' has a wrong offset!");
static_assert(offsetof(FGPUNPCInstanceItem, InstanceTransform_31_528928834ADA639083CC9786B1908600) == 0x000010, "Member 'FGPUNPCInstanceItem::InstanceTransform_31_528928834ADA639083CC9786B1908600' has a wrong offset!");

}

