#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaLiveFunctions

#include "Basic.hpp"

#include "NinjaPreset_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SimPrecision_Enum_structs.hpp"
#include "RenderTargetListItem_structs.hpp"


namespace SDK::Params
{

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.TraceOverlapSingle
// 0x0210 (0x0210 - 0x0000)
struct NinjaLiveFunctions_C_TraceOverlapSingle final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TracelineOvershoot;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    TraceMesh;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HitUV;                                             // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TracePosition;                                     // 0x0040(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetWorld_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue;    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_Conv_VectorToVectorDouble_ReturnValue_1;  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_LineTraceComponent_HitLocation;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_D_K2_LineTraceComponent_HitNormal;        // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_D_K2_LineTraceComponent_BoneName;         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_D_K2_LineTraceComponent_OutHit;           // 0x00D0(0x0094)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_D_K2_LineTraceComponent_ReturnValue;      // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_167[0x1];                                      // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_KuroFindCollisionUV_UV;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_KuroFindCollisionUV_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveFunctions_C_TraceOverlapSingle) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_TraceOverlapSingle");
static_assert(sizeof(NinjaLiveFunctions_C_TraceOverlapSingle) == 0x000210, "Wrong size on NinjaLiveFunctions_C_TraceOverlapSingle");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, Start) == 0x000000, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::Start' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, End) == 0x00000C, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::End' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, TracelineOvershoot) == 0x000018, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::TracelineOvershoot' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, TraceMesh) == 0x000020, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::TraceMesh' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, __WorldContext) == 0x000028, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, HitUV) == 0x000030, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::HitUV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, TracePosition) == 0x000040, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::TracePosition' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_GetWorld_ReturnValue) == 0x000058, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_GetWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Conv_VectorToVectorDouble_ReturnValue) == 0x000060, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Conv_VectorToVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00007C, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Conv_VectorToVectorDouble_ReturnValue_1) == 0x000088, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Conv_VectorToVectorDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_D_K2_LineTraceComponent_HitLocation) == 0x0000A0, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_D_K2_LineTraceComponent_HitLocation' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_D_K2_LineTraceComponent_HitNormal) == 0x0000B8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_D_K2_LineTraceComponent_HitNormal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_D_K2_LineTraceComponent_BoneName) == 0x0000C4, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_D_K2_LineTraceComponent_BoneName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_D_K2_LineTraceComponent_OutHit) == 0x0000D0, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_D_K2_LineTraceComponent_OutHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_D_K2_LineTraceComponent_ReturnValue) == 0x000164, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_D_K2_LineTraceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_bBlockingHit) == 0x000165, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_bInitialOverlap) == 0x000166, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_Time) == 0x000168, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_Distance) == 0x00016C, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_Location) == 0x000170, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_ImpactPoint) == 0x00017C, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_ImpactNormal) == 0x000194, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_HitItem) == 0x0001C4, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_TraceStart) == 0x0001CC, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_IsValid_ReturnValue_1) == 0x0001E4, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_KuroFindCollisionUV_UV) == 0x0001E8, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_KuroFindCollisionUV_UV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_KuroFindCollisionUV_ReturnValue) == 0x0001F0, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_KuroFindCollisionUV_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0001F4, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlapSingle, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000200, "Member 'NinjaLiveFunctions_C_TraceOverlapSingle::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.CameraFacing
// 0x0188 (0x0188 - 0x0000)
struct NinjaLiveFunctions_C_CameraFacing final
{
public:
	class USceneComponent*                        InMesh;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLegacyFacing;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LockY;                                             // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               TraceMeshInitRot;                                  // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetComponentLocation_ReturnValue;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue_1;  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00F4(0x0094)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NinjaLiveFunctions_C_CameraFacing) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_CameraFacing");
static_assert(sizeof(NinjaLiveFunctions_C_CameraFacing) == 0x000188, "Wrong size on NinjaLiveFunctions_C_CameraFacing");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, InMesh) == 0x000000, "Member 'NinjaLiveFunctions_C_CameraFacing::InMesh' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, UseLegacyFacing) == 0x000008, "Member 'NinjaLiveFunctions_C_CameraFacing::UseLegacyFacing' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, LockY) == 0x000009, "Member 'NinjaLiveFunctions_C_CameraFacing::LockY' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, TraceMeshInitRot) == 0x00000C, "Member 'NinjaLiveFunctions_C_CameraFacing::TraceMeshInitRot' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, __WorldContext) == 0x000018, "Member 'NinjaLiveFunctions_C_CameraFacing::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, ___bool_Variable) == 0x000020, "Member 'NinjaLiveFunctions_C_CameraFacing::___bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_GetCameraRotation_ReturnValue) == 0x000048, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x000054, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_ComposeRotators_ReturnValue) == 0x000060, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_D_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_D_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, ___bool_Variable_1) == 0x000088, "Member 'NinjaLiveFunctions_C_CameraFacing::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_Conv_VectorDoubleToVector_ReturnValue_1) == 0x00008C, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_Conv_VectorDoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_FindLookAtRotation_ReturnValue) == 0x000098, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_BreakRotator_Roll) == 0x0000A4, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_BreakRotator_Pitch) == 0x0000A8, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_BreakRotator_Yaw) == 0x0000AC, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_MakeRotator_ReturnValue) == 0x0000B4, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_ComposeRotators_ReturnValue_1) == 0x0000C4, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D0, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, K2Node_Select_Default) == 0x0000DC, "Member 'NinjaLiveFunctions_C_CameraFacing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, K2Node_Select_Default_1) == 0x0000E8, "Member 'NinjaLiveFunctions_C_CameraFacing::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_CameraFacing, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000F4, "Member 'NinjaLiveFunctions_C_CameraFacing::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.RenderTgAcquisitionStatus
// 0x0230 (0x0230 - 0x0000)
struct NinjaLiveFunctions_C_RenderTgAcquisitionStatus final
{
public:
	const class UObject*                          SelfRef;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RT_number___added;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESimPrecision_Enum                            SimPrecision;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResX;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResY;                                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PoolManDetected;                                   // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HalfRes;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfChannels;                                  // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Print;                                             // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	float                                         MemConsumtion;                                     // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_3;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_4;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_5;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_6;          // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_7;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_2;                                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_8;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESimPrecision_Enum                            ___byte_Variable;                                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_RenderTgAcquisitionStatus");
static_assert(sizeof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus) == 0x000230, "Wrong size on NinjaLiveFunctions_C_RenderTgAcquisitionStatus");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, SelfRef) == 0x000000, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::SelfRef' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, RT_number___added) == 0x000008, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::RT_number___added' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, SimPrecision) == 0x00000C, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::SimPrecision' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ResX) == 0x000010, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::ResX' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ResY) == 0x000014, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::ResY' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, PoolManDetected) == 0x000018, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::PoolManDetected' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, HalfRes) == 0x000019, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::HalfRes' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, NumberOfChannels) == 0x00001C, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::NumberOfChannels' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, __WorldContext) == 0x000020, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, Print) == 0x000028, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::Print' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, MemConsumtion) == 0x000038, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::MemConsumtion' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue) == 0x000040, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralInt_ReturnValue) == 0x000050, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_GetDisplayName_ReturnValue) == 0x000080, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000090, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_2) == 0x0000A0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_SelectString_ReturnValue) == 0x0000B0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ___int_Variable) == 0x0000C0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::___int_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_3) == 0x0000C8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_4) == 0x0000D8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ___int_Variable_1) == 0x0000E8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, K2Node_Select_Default) == 0x0000F0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_5) == 0x000110, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_6) == 0x000120, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000130, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_7) == 0x000140, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000150, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000160, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000170, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000180, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000190, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0001A0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0001B0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0001C0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ___int_Variable_2) == 0x0001D0, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::___int_Variable_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_MakeLiteralString_ReturnValue_8) == 0x0001D8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_MakeLiteralString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Concat_StrStr_ReturnValue_10) == 0x0001E8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, ___byte_Variable) == 0x0001F8, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::___byte_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_SelectString_ReturnValue_1) == 0x000200, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, K2Node_Select_Default_1) == 0x000210, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000214, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000218, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00021C, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000220, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000224, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_RenderTgAcquisitionStatus, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000228, "Member 'NinjaLiveFunctions_C_RenderTgAcquisitionStatus::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.AcquireRenderTargetsFromPool
// 0x0128 (0x0128 - 0x0000)
struct NinjaLiveFunctions_C_AcquireRenderTargetsFromPool final
{
public:
	int32                                         Request_0isRGBA1isRG2isR;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Host_RenderTG_List_Index;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         RenderTargetList;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UTextureRenderTarget2D*> RenderTargetsMapTmp;                          // 0x0020(0x0050)(Parm, OutParm)
	TMap<class FString, class UTextureRenderTarget2D*> RenderTargetsMap;                             // 0x0070(0x0050)(Edit, BlueprintVisible)
	TArray<class ANinjaLive_MemoryPoolManager_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C0(0x0010)(ReferenceParm)
	class ANinjaLive_MemoryPoolManager_C*         CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRenderTargetListItem>          K2Node_Select_Default;                             // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRenderTargetListItem                  K2Node_MakeStruct_RenderTargetListItem;            // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_AcquireRenderTargetsFromPool");
static_assert(sizeof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool) == 0x000128, "Wrong size on NinjaLiveFunctions_C_AcquireRenderTargetsFromPool");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, Request_0isRGBA1isRG2isR) == 0x000000, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::Request_0isRGBA1isRG2isR' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, Host_RenderTG_List_Index) == 0x000004, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::Host_RenderTG_List_Index' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, RenderTargetList) == 0x000008, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::RenderTargetList' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, __WorldContext) == 0x000018, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, RenderTargetsMapTmp) == 0x000020, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::RenderTargetsMapTmp' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, RenderTargetsMap) == 0x000070, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::RenderTargetsMap' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C0, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, ___bool_Variable) == 0x0000E8, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::___bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Not_PreBool_ReturnValue) == 0x0000E9, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, ___int_Variable) == 0x0000EC, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::___int_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, ___int_Variable_1) == 0x0000F4, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, K2Node_Select_Default) == 0x0000F8, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_Subtract_IntInt_ReturnValue) == 0x00010C, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000110, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_AcquireRenderTargetsFromPool, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000111, "Member 'NinjaLiveFunctions_C_AcquireRenderTargetsFromPool::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
