#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaLiveInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function NinjaLiveInterface.NinjaLiveInterface_C.LiveFluidParams
// 0x0004 (0x0004 - 0x0000)
struct NinjaLiveInterface_C_LiveFluidParams final
{
public:
	float                                         BrushSize;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveInterface_C_LiveFluidParams) == 0x000004, "Wrong alignment on NinjaLiveInterface_C_LiveFluidParams");
static_assert(sizeof(NinjaLiveInterface_C_LiveFluidParams) == 0x000004, "Wrong size on NinjaLiveInterface_C_LiveFluidParams");
static_assert(offsetof(NinjaLiveInterface_C_LiveFluidParams, BrushSize) == 0x000000, "Member 'NinjaLiveInterface_C_LiveFluidParams::BrushSize' has a wrong offset!");

// Function NinjaLiveInterface.NinjaLiveInterface_C.LiveActivation
// 0x0014 (0x0014 - 0x0000)
struct NinjaLiveInterface_C_LiveActivation final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTimeOfBrush;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTimeOfCanvas;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveInterface_C_LiveActivation) == 0x000004, "Wrong alignment on NinjaLiveInterface_C_LiveActivation");
static_assert(sizeof(NinjaLiveInterface_C_LiveActivation) == 0x000014, "Wrong size on NinjaLiveInterface_C_LiveActivation");
static_assert(offsetof(NinjaLiveInterface_C_LiveActivation, ParamName) == 0x000000, "Member 'NinjaLiveInterface_C_LiveActivation::ParamName' has a wrong offset!");
static_assert(offsetof(NinjaLiveInterface_C_LiveActivation, FadeTimeOfBrush) == 0x00000C, "Member 'NinjaLiveInterface_C_LiveActivation::FadeTimeOfBrush' has a wrong offset!");
static_assert(offsetof(NinjaLiveInterface_C_LiveActivation, FadeTimeOfCanvas) == 0x000010, "Member 'NinjaLiveInterface_C_LiveActivation::FadeTimeOfCanvas' has a wrong offset!");

}

