#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaLive_PresetManager

#include "Basic.hpp"

#include "NinjaPreset_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.MarkForSave_UE426_BugWorkaround
// 0x00D0 (0x00D0 - 0x0000)
struct NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround final
{
public:
	class UObject*                                CurrentAsset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AssetName;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue;              // 0x0018(0x0068)(HasGetValueTypeHash)
	TScriptInterface<class IInterface>            CallFunc_GetAssetTools_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFallbackStruct                        K2Node_MakeStruct_AssetRenameData;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFallbackStruct>                K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_RenameAssets_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround");
static_assert(sizeof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround) == 0x0000D0, "Wrong size on NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CurrentAsset) == 0x000000, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CurrentAsset' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, AssetName) == 0x000008, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::AssetName' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CallFunc_CreateAssetData_ReturnValue) == 0x000018, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CallFunc_CreateAssetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CallFunc_GetAssetTools_ReturnValue) == 0x000080, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CallFunc_GetAssetTools_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CallFunc_Conv_NameToString_ReturnValue) == 0x000090, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000A0, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, K2Node_MakeStruct_AssetRenameData) == 0x0000B0, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::K2Node_MakeStruct_AssetRenameData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, K2Node_MakeArray_Array) == 0x0000B8, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround, CallFunc_RenameAssets_ReturnValue) == 0x0000C8, "Member 'NinjaLive_PresetManager_C_MarkForSave_UE426_BugWorkaround::CallFunc_RenameAssets_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.ConvertToPowerOfTwo
// 0x0020 (0x0020 - 0x0000)
struct NinjaLive_PresetManager_C_ConvertToPowerOfTwo final
{
public:
	int32                                         In;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Out;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Log_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo) == 0x000004, "Wrong alignment on NinjaLive_PresetManager_C_ConvertToPowerOfTwo");
static_assert(sizeof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo) == 0x000020, "Wrong size on NinjaLive_PresetManager_C_ConvertToPowerOfTwo");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, In) == 0x000000, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::In' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, Out) == 0x000004, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::Out' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_Log_ReturnValue) == 0x00000C, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_Log_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_Round_ReturnValue) == 0x000010, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000014, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000018, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ConvertToPowerOfTwo, CallFunc_Round_ReturnValue_1) == 0x00001C, "Member 'NinjaLive_PresetManager_C_ConvertToPowerOfTwo::CallFunc_Round_ReturnValue_1' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.GetCurrentLevelInfo
// 0x00E8 (0x00E8 - 0x0000)
struct NinjaLive_PresetManager_C_GetCurrentLevelInfo final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelPath;                                         // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<struct FAssetData>                     CallFunc_GetAssetsByClass_OutAssetData;            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAssetsByClass_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_Array_Get_Item;                           // 0x0060(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NinjaLive_PresetManager_C_GetCurrentLevelInfo) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_GetCurrentLevelInfo");
static_assert(sizeof(NinjaLive_PresetManager_C_GetCurrentLevelInfo) == 0x0000E8, "Wrong size on NinjaLive_PresetManager_C_GetCurrentLevelInfo");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, LevelName) == 0x000000, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::LevelName' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, LevelPath) == 0x00000C, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::LevelPath' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, ___int_Array_Index_Variable) == 0x000018, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, ___int_Loop_Counter_Variable) == 0x00001C, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000028, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_GetAssetRegistry_ReturnValue) == 0x000038, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_GetAssetsByClass_OutAssetData) == 0x000048, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_GetAssetsByClass_OutAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_GetAssetsByClass_ReturnValue) == 0x000058, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_GetAssetsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_Array_Get_Item) == 0x000060, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_GetCurrentLevelInfo, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E0, "Member 'NinjaLive_PresetManager_C_GetCurrentLevelInfo::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.MarkNewFilesAsUnsaved
// 0x0098 (0x0098 - 0x0000)
struct NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved final
{
public:
	TArray<struct FAssetData>                     ArrayOfUnsaveAssetData;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             CallFunc_Array_Get_Item;                           // 0x0020(0x0068)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved");
static_assert(sizeof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved) == 0x000098, "Wrong size on NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, ArrayOfUnsaveAssetData) == 0x000000, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::ArrayOfUnsaveAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, ___int_Array_Index_Variable) == 0x000014, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, ___int_Loop_Counter_Variable) == 0x000018, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_Array_Get_Item) == 0x000020, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_GetAsset_ReturnValue) == 0x000088, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'NinjaLive_PresetManager_C_MarkNewFilesAsUnsaved::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.DataTable_SingleKeyPicker_DT
// 0x0078 (0x0078 - 0x0000)
struct NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT final
{
public:
	class UDataTable*                             DataTableIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 KeyToPick;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PickedKeyValue;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          NotFound;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RowNotFound;                                       // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNinjaPreset                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT");
static_assert(sizeof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT) == 0x000078, "Wrong size on NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, DataTableIn) == 0x000000, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::DataTableIn' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, KeyToPick) == 0x000008, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::KeyToPick' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, PickedKeyValue) == 0x000018, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::PickedKeyValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, NotFound) == 0x000028, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::NotFound' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, RowNotFound) == 0x000029, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::RowNotFound' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_Conv_StringToName_ReturnValue) == 0x00002C, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_MakeLiteralString_ReturnValue) == 0x000058, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'NinjaLive_PresetManager_C_DataTable_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.Preset_SingleKeyPicker_DT
// 0x0228 (0x0228 - 0x0000)
struct NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT final
{
public:
	class FString                                 PresetName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 KeyToPick;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UDataTable*                             DataTable;                                         // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PickedKeyValue;                                    // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<struct FAssetData>                     CallFunc_GetAssetsByClass_OutAssetData;            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAssetsByClass_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0068)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As____;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FNinjaPreset                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue;              // 0x0190(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT");
static_assert(sizeof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT) == 0x000228, "Wrong size on NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, PresetName) == 0x000000, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::PresetName' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, KeyToPick) == 0x000010, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::KeyToPick' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, DataTable) == 0x000020, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::DataTable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, PickedKeyValue) == 0x000028, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::PickedKeyValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, ___int_Array_Index_Variable) == 0x000038, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Conv_StringToName_ReturnValue) == 0x00003C, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, ___int_Loop_Counter_Variable) == 0x000048, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_MakeLiteralString_ReturnValue) == 0x000050, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetAssetRegistry_ReturnValue) == 0x000068, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetAssetsByClass_OutAssetData) == 0x000078, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetAssetsByClass_OutAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetAssetsByClass_ReturnValue) == 0x000088, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetAssetsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Conv_NameToString_ReturnValue) == 0x000090, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetAsset_ReturnValue) == 0x000118, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000120, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, K2Node_DynamicCast_As____) == 0x000130, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000140, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetDataTableRowFromName_OutRow) == 0x000150, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000160, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000168, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000180, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_CreateAssetData_ReturnValue) == 0x000190, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_CreateAssetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Array_Length_ReturnValue) == 0x0001F8, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Less_IntInt_ReturnValue) == 0x0001FC, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000200, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000210, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT, CallFunc_Contains_ReturnValue) == 0x000220, "Member 'NinjaLive_PresetManager_C_Preset_SingleKeyPicker_DT::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.AssetDataFromObject
// 0x0208 (0x0208 - 0x0000)
struct NinjaLive_PresetManager_C_AssetDataFromObject final
{
public:
	class UObject*                                InputObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             ComboAssetData;                                    // 0x0008(0x0068)(Parm, OutParm, HasGetValueTypeHash)
	class FName                                   Object_Path;                                       // 0x0070(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Package_Name;                                      // 0x007C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Package_Path;                                      // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Asset_Name;                                        // 0x0094(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Asset_Class;                                       // 0x00A0(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x00B8(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftClassReferenceToString_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0120(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            CallFunc_GetAssetTools_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<class UObject*>                        CallFunc_FindSoftReferencesToObject_ReferencingObjects; // 0x0158(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_Select_Default;                             // 0x0178(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue;              // 0x01A0(0x0068)(HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_AssetDataFromObject) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_AssetDataFromObject");
static_assert(sizeof(NinjaLive_PresetManager_C_AssetDataFromObject) == 0x000208, "Wrong size on NinjaLive_PresetManager_C_AssetDataFromObject");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, InputObject) == 0x000000, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::InputObject' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, ComboAssetData) == 0x000008, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::ComboAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, Object_Path) == 0x000070, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::Object_Path' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, Package_Name) == 0x00007C, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::Package_Name' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, Package_Path) == 0x000088, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::Package_Path' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, Asset_Name) == 0x000094, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::Asset_Name' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, Asset_Class) == 0x0000A0, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::Asset_Class' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_GetObjectClass_ReturnValue) == 0x0000B0, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x0000B8, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, ___int_Array_Index_Variable) == 0x0000E8, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Conv_SoftClassReferenceToString_ReturnValue) == 0x0000F0, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Conv_SoftClassReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_LeftChop_ReturnValue) == 0x000100, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, K2Node_MakeArray_Array) == 0x000110, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000120, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, ___int_Loop_Counter_Variable) == 0x000140, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_GetAssetTools_ReturnValue) == 0x000148, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_GetAssetTools_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_FindSoftReferencesToObject_ReferencingObjects) == 0x000158, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_FindSoftReferencesToObject_ReferencingObjects' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Array_Length_ReturnValue) == 0x00016C, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000170, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, ___bool_Variable) == 0x000171, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::___bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, K2Node_Select_Default) == 0x000178, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Array_Get_Item) == 0x000190, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_AssetDataFromObject, CallFunc_CreateAssetData_ReturnValue) == 0x0001A0, "Member 'NinjaLive_PresetManager_C_AssetDataFromObject::CallFunc_CreateAssetData_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.Preset_to_InternalCSV_to_DT_Saver
// 0x04D0 (0x04D0 - 0x0000)
struct NinjaLive_PresetManager_C_Preset_to_InternalCSV_to_DT_Saver final
{
public:
	bool                                          OverWriteFlag;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VarAsString;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SelectedItem;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           AssetPaths;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   AssetName;                                         // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANinjaLive_PresetManager_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ANinjaLive_PresetManager_C*             CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAssetData>                     K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00C0(0x0010)(ReferenceParm)
	TArray<class UObject*>                        CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x00D0(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             K2Node_MakeSet_Set;                                // 0x00F0(0x0050)()
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0150(0x0010)(ReferenceParm)
	struct FARFilter                              K2Node_MakeStruct_ARFilter;                        // 0x0160(0x00F0)()
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            CallFunc_GetAssetTools_ReturnValue;                // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          ___bool_Variable;                                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAssetData>                     CallFunc_GetAssets_OutAssetData;                   // 0x0298(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAssets_ReturnValue;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     K2Node_Select_Default;                             // 0x02E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             CallFunc_Array_Get_Item_3;                         // 0x02F8(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As____;                         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
