#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsTaskFollowPlayerSoftMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SFollowMoveInfo_structs.hpp"
#include "SFollowRotateInfo_structs.hpp"
#include "TsTaskAbortImmediatelyBase_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsTaskFollowPlayerSoftMode.TsTaskFollowPlayerSoftMode_C
// 0x0078 (0x0130 - 0x00B8)
class UTsTaskFollowPlayerSoftMode_C final : public UTsTaskAbortImmediatelyBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TsTaskFollowPlayerSoftMode_C;       // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSFollowMoveInfo                       MoveInfo;                                          // 0x00C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSFollowRotateInfo                     RotateInfo;                                        // 0x0100(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsTaskFollowPlayerSoftMode(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsTaskFollowPlayerSoftMode_C">();
	}
	static class UTsTaskFollowPlayerSoftMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsTaskFollowPlayerSoftMode_C>();
	}
};
static_assert(alignof(UTsTaskFollowPlayerSoftMode_C) == 0x000008, "Wrong alignment on UTsTaskFollowPlayerSoftMode_C");
static_assert(sizeof(UTsTaskFollowPlayerSoftMode_C) == 0x000130, "Wrong size on UTsTaskFollowPlayerSoftMode_C");
static_assert(offsetof(UTsTaskFollowPlayerSoftMode_C, UberGraphFrame_TsTaskFollowPlayerSoftMode_C) == 0x0000B8, "Member 'UTsTaskFollowPlayerSoftMode_C::UberGraphFrame_TsTaskFollowPlayerSoftMode_C' has a wrong offset!");
static_assert(offsetof(UTsTaskFollowPlayerSoftMode_C, MoveInfo) == 0x0000C0, "Member 'UTsTaskFollowPlayerSoftMode_C::MoveInfo' has a wrong offset!");
static_assert(offsetof(UTsTaskFollowPlayerSoftMode_C, RotateInfo) == 0x000100, "Member 'UTsTaskFollowPlayerSoftMode_C::RotateInfo' has a wrong offset!");

}

